{
  "responseHeader":{
    "status":0,
    "QTime":1,
    "params":{
      "q":"*:*",
      "indent":"true",
      "wt":"json"}},
  "response":{"numFound":1495,"start":0,"docs":[
      {
        "city":"Towanda",
        "loc":"-76.443069458,41.7647781372",
        "text":"The Daily Review.\nTowanda, Pa., Friday, Dec'r 19, 1879.\n■ BITOKS :\n8. W. ALVORI). NOBLE N. ALVOITD.\n\"Daily Review*\" maly 95 cent* per\nvmmwwth. Wry it.\nMails arrive depart and at the Towanda\nPost office follows.\nARRIVE.\nPhila. N. Y. and Eastern States.. 4.oo A, M-\nDushore Laporte &c 9.530 \"\nL. V. way mail from the North. .10.00 \"\nSheshequin &c 11.00 \"\nNew Era fce Tues. Thur and Sat. \" \"\nAsylum &c Mon. Wed. and Fri. \" \"\nTroy Burlington &e 1.00 p. M.\nLeßaysville Rome &e \" \"\nClosed mail from Erie &NCIt R s *2.30 \"\nL, V. way mail from the 50uth...4.30 \"\nCanton &c 5.00 \"\nBarclay 0.510 \"\nCl's'd mail fr'm Elmira & Erie 1t1t10.40 \"\nDEPART.\nCanton Monroeton &c 0.00 A. M.\nL. V. way mail South 9.15 '•\nCl's'd m,l Elmira Erie &NC It 1110.00 \"\nTroy Burlington &c 10.00 \"\nSneshcquin Ac 12.00 M.\nBarclay 1.00 p. M.\nNew Era Tuos Thur and Sat.... \" \"\nAsylum Mon Wed and Fri \" \"\nLeltaysvide ltome &c •' \"\nDushore &e 2.45 \"\n'j. V. way mail North 3.45 \"\nN Y Phil and EaslarnStates....7.4s \"\nOffice open from 7.00 A. M. t07.45 P. M.\nMoneY Order office open from 8.00 A. M. to\n7.00 p. M.\nOffice open Sunday's from 9.00 to 10.00 A.M.\nP. POWELL, P. M.\nQuite a fall of snow last night.\nThe next session of Mr. ACKLEY'S singing\nclass will be held Wednesday, January 7.\nCountry dealers will find it to their advant\nage to buy their candies at FITCH'S.\nThe only fall of coal we hear of now-u-days is\nwhen some poor miner gets crushed beneath\na big lump.\nA deuf and dumb boy now sells the Elmira\nAdvertiser in this place, and he is a good\nsalesman too.\nRUNDELL, of the meat market, received\norders from the coal regions for three tons of\npoultry this week.\nThe Advocate says if Elmira don't want\nher thieves arrested she must keep them\naway from Waverly.\n\"What a charming number\" says every one\non looking into Scribner's for January,\nwhich is already out.\nAnd that reminds us that Scribner\\ s\nMonthly would make a most appropriate and\nvaluable Christmas present to any intelligent\nperson. We can furnish it to our subscribers\nfor $3.20.\nSheriff DEAN makes things pleasant for the\nprisoners in his keeping. Over the door of\none cell is this inscription, in plain black let.-\ntes: \"God bless our home.\"\nFERRIS, the U. S. prisoner now confined\nin the Tunkhannock jail is turning his con\nfinement to good account. lb* has made a\ncontract with the commissioners to repair the\nprison.\nIf you are going to make a Christmas pres\nent of a watch, or any article of jewelry, you\nwill save from fen to twenty-five per cent, by\nordering from ROGALSKI, one door south\nof First. National Bank. Call and see him.\nIt is scarcely necessary for us to inform our\nlady readers that they can find the best assort\nment of dress goods, ribbons, and funcv arti\ncles suitable for holiday presents at Mr.\nKENT'S. Mr. K's good taste in the selection\nof such articles is proverbial.\nThe large invoice of books have arrived at\nthe auction store, and the sale will commence\nto-morrow evening. The stock comprises\nBibles of of every diseription from the cheap\nest to elegant family Bibles, standard books,\ngift and juvenile books, all of which will be\nsold at prices which will astonish everybody\nDon't make your Christinas purchases until\nyou have seen them.\nThe Towanda correspondent of the Elmira\nGazette , who is posted on the subject, and\nknows whereof he affirms, lias this to say in\nregard to the approaching dramatic enter\ntainment in this place:\n\"The handsomest lady in Towanda takes\npart in the \"Johnson benefit.\" No one per\nson will be allowed to purchase more than\nten reserved seats for the \"Johnson benefit.\"\nThis will do away with much of the unpleas\nantness which has been experienced hereto\nfore in getting a good reserved scat.\nThe Convent School will take a recess from\nDecember 11) till the day after Epiphany.\nIn this busy season of the year when every\nfemale member of the household is so busy\npreparing for Christmas, the frugal house\nwife wiil thank us, we know, for the infor\nmation that Mr. MULLOCK, at Jon DAN'S\nMarket, keeps a large supply oi prepared\nMince Meat, warranted equal to any that the\nmost fastidious epicure can desire, or the most\nskillful culinary artist can prepare.\nTHK NKW YORK TRIBUNE.— For the Pres\nidential year every well-informed citizen\nshould have a leading metropolitan newspa\nper. We commend to all such the annual\nprospectus of the New York Tribune , which\nwe print in another column. For nearly\nforty years the Tribune has been a great\npower for good in* this country, and it never\nwas a better paper than it is now, and never\nwielded a greater influence in favor of the\nright in politics, as well as morals, than it\ndoes to-day. We commend it to every family\nas a paper that cannot be read without profli.\nIts otter of Chamber's Cycloptedia as a premi\num, is on terms so low as to be phenomenal.\nPersonal.\nM. J. RYAN, of Lcadville, Colorado, is reg\nistered at the Ward House.\nMrs. JOHN DEAN is convalescent, and\nto the pleasure of her many friends is\nagain seen in society.\nJudge MERCUK and HonE. O. .GOODRICH\nattended the reception given in honor of Gen.\nGRANT by Mayor STOKELY. in Philadelphia,\non Wednesday evening.\nThe Congressional Directory contains the\nnames of WM. GIUFFIS as Messenger in the\nSenate, and Hon. W. W. KINGSBURY, Chief\nClerk to Election Frauds Committee.\nJOHN O. WARD, who has been absent\nseveral weeks on a tour through Virginia\nand North Carolina, returned yesterday.\nOur young friend BREZEE, of I)YE & Co.'s,\nis enjoying a vacation, visiting friends in\nNew York Si ale, and Mrs. Grundy says he\nwill bring back with him one of the fair\nmaidens of Cooperstown as his bride.\nWe are indebted to Col. OVERTON for a\ncopy of the Congressional Directory for the\npresent session. The compiler makes this\nnotice of our member:\n\"FIFTEENTH DISTRICT.\nCounties —Bradford, Susquehanna, Wayne\nand Wyoming.\nEdward Overton, Jr., of Towanda, was\nborn at Towanda, Pennsylvania. February 1,\nISSHS; graduated at Princeton College, New\nJersey, in 185(5; was admitted to the liar in\n1858; entered the Union Army in September\nINtit, as Major of the Fiftieth Regiment of\nPennsylvania Volunteers; was promoted to\nLieutenant Colonel in lHtt'), and from that\ntime commanded the regiment until mustered\nout October, 18(54; sorved as Register in\nBankruptcy from ls<7 until elected in 187(5 to\nthe Forty-fifth Congress; and was re-elected\nto the Forty-sixth Congress as a Republican,\nreceiving 13,145 votes against 3,783 votes for\nDimmick. Democrat, and 9,5321 votes lor\nDeWitt, National.\"\nWe are surprised and gratified at the evi\ndence of thrift and large business which a\nvisit to JAMES MCCABE'S store furnishes. IT\nwill be remembered that Mr. McC. closed\nout his stock about a year ago, with the in\ntention of retiring from trade, but his numer\nous customers, in town and out. prevailed\nupon him to continue, and with an entirely\nfresh stock of family groceries, he opened a\nstore in Mercur Block, late last sping. His\nold customers, and many new ones, were not\nslow in finding him out , and his establishment\nnow presents the appearance of a bee-hive.\nHe buys for cash, and never keeps inferior\ngoods; is frank and honest in his dealings, so\nthat the poorest child in town is treated wi.li\nthe same respect and courtesy, ami receives\nthe same quality of goods that the richest inau\nwould. It is no wonder that such a dealer\nis always crowded with customers.\nFITCII has the best assortment of common\nand tine candies, including WHITMAN'S cele\nbrated confections, ever offered in this market.\nNow is the time to make your Christmas pur\nchases.\nO. A. BLACK has fitted up an office on the\nsecond floor of the building lately oeeupid by\nthe crockery store, where lie will confine him\nself to the Sewing Machine and Insurance\nbusiness.\nWhen you start out to purchase candies,\nfruits and confectionery, remember that\nFITCH'S is headquarters for all those articles,\nand you can rely upon getting a genuine arti\ncle. He manufactures most of his candy, and\nis enabled to furnish his customers fresh\nstock.\nLOST. —Off the hearse, on Wednesday,\nDecember 17th, between J. O. FKOST'S SONS\nFurniture Store and Guyer's school house, a\nLight Rubber Coat. The finder will be liber\nally rewarded by leaving the same at J. O.\nFROST'S SONS.\nSEYMOUR SMITH.\nLOST. —One Fur Gauntlet Glove for tin\nright hand. The finder will be rewarded by\nleaving it either at DAYTON'S Harness Shop\nor at the Postoffice.\nGEO. A. DAYTON.\nTowanda, Dec. 16, IH.TD.\nPOCKET-BOOK IA>ST. The undersigned\nlost on Wednesday afternoon, in Towanda,\nbeiween Dr. Pratt's office and Bridge street,\na lady's lted Morocco Pocket-book, contain\ning 26 dollars in $1 and $2 bills. The finder\nw'll be liberally rewarded by delivering it\nwith the money at the Ward House.\nMiss BKII>GII<: BKKNNAN.\nTowanda, Dec. 8, 1879.\nThe annual meei mg of the stockhold\ners of the Towanda Bridge Co., for eleceion\nof a President, Treasurer and Six Managers\nto serve tin; ensuing year, will be held at the\nFirst Nai-onal Bank of Towanda, on Wednes\nday January 7, 1880, between the hours one\nand three o'clock, p. in.\nDec. 2, 1876. N. N. BKTTS, Seer -tary.\nrS\" IMPORTANT TO SCHOOL DIREC\nTORS AND TAX PAYERS—The fol\nlowing decision of the Superintendent of\nPublic Instruction is of great importance to\ntax-payers as well as directors, as violation\nof the law upon the subject will deprive di -\n. riots of the State appropriation, and subject\nDirectors to severe penalties:\nDEPARTMENT OK PUB. INS., )\nHarrisburg, Pa., Dec. 1, 1876. J\nThere is but one time in the year when di\nrer, ors can adopt a new series of text books\nfor the schools under their charge, or change\nold ones, and that is between the time of\nelecting teachers and the opening of the\nschools. Section 26, Act of M; y 1.1854, says :\n\"That immediately after tin; annual election\nof teachers in each school district of the state,\nand la-fere the opening of the schools for the\nensuing term, there shall be a meeting of the\nd'eaoors or controllers and teachers of each\ndistrict; at which meeting the directors or\ncontrollers shall decide upon a series of school\nbooks, in the different branches to be taught\nduring the ensuing school year; which books,\nand no other, shall be used in the schools of\nthe district during said period.\"\nSuch is the law, with this exception, that\nbooks cannot now be changed more frequent\nly than once in three years.\nJ. P. WICKERSIIAM,\nSuperintendent Public Instruction.\nDealers are paying t e following prices to\nday :\niley, per ton, sll 00\nWheat, per bushel, 1 25\nBuckwheat, \" 50\nRye. 44 70\nOats, 44 ;ks\nCorn, 44 56\nPotatoes, 44 ;to\nApples, 44 40 to 50\nEggs, per doz. 21\nButter, 28 to 28\nLard. 7 to 8\nPork, ft\nChickens, 7 to S\nWANTS.\nUnder this head we will insert FREE, notices of\nsituations or help wanted.\nMrs CUKKAN, on street west of FKOST'S\nFurniture factory, would like work at plain\nsewing, tailoring, carpet making, or washing\nand ironing.\nA young girl who can tend baby, wash\ndishes, etc., can secure a good situation by\ncalling on James Wood.\nA young man of good moral habits wishes\na situation in a Dry Goods or Grocery store,\nthree years' experience. Good references\nBUBIN ESS LOCAI S.\nThis NOTICE is intended to inform all per\nsons indebted to the late tinn of MCINTYKH\n& RUSSELL that they must make immediate\npayment or costs will be made. The books\nand aceoun s arc in the hands of\nJAMES WOOD, Attorney-at-law,\nTowanda, Pa.\nThe PARAGON School Desk is the best in\nthe market. Warranted not to get out of\norder or break. Call at FKOST'S SONS Fur\nniture Store and examine the same. tf\nIf you want the best vegetables, the largest\noysters, the best cuts of meat, and the finest\nset sage to be found in Towanda, call on Mr.\nMULLOCK, at the old Market, just south of\nthe Ward I louse,\nGeo Lyncheome has opened a new\nBarber Shoo over Powell's store where he is\nalways ready to wait upon all those who may\nfavor him with their patronage. Shampooing\nhair cutting Ladies' and Children's hair at\nt.liejr residence no extra charge.\n%PB~Jacobs is selling Overcoats all the way\nfrom $2 up to anv price vou are willing to\npay.\nCigars of about every known brand at\nFITCH'S.\nDon't put off your Christmas purchase*\nuntil the last moment. FITCH has a full line\nof candies and confections, and now is the\ntime to make your selections.\nMrs. FI.KTCIIKK is selling millinery good*\nat cost.\nPrices way down in Gents tine and coarse\nboots and shoes. All goods warranted, as\nrepresented, at BRUM'S.\nOn account of a change in my business,\n1 will sell Millinery Goods at cost.\nMrs. M. A. FLKTCHKK,\nNo. 4 Bridge street.\nThe continued mild weather has induced\nROMKNFIKLD, the Clothing merchant, to re\nduce the price of Overcoats and other winter\nClothing. Call and secure bargains. There\nwill be plenty of cold weather yet.\nFor a good, durable and neat fitting shoe,\ngo to BLUM'S.\nPATCH BROTHKRS pay 80 cents, in cash,\nfor pheasants, and the highest price fur but\nter.\nfljgf'if you want a stylish hat. cheaper than\nyou ever bought one, call at ROSKNFIKLD'S\nclothing store.\nJQfChoiee Hams and Smoked Beef, at\nMYKII k DKVOK'S market, Bridge Street.\nOVKRCOATS so cheap that you can afford to\nbuy two or three, at HOSKXFIKLD'S elotliing\nstore.\nit'Jf At MYKII k DKVOK'S market is the\nplace to get tender steaks and nice roast s.\nIT'iFM ver k Devoe are receiving fresh\nOysters daily, at their market. Bridge St.\nft TT'Buy your fresh fish at KUNDKLL'S.\n®3TMYKR k DKVOK keep the largest and\nbest assortment of Fruits and Vegetables in\ntown.\nj3TGo to E. D. RUNDELL'B for the best\nSteaks and Roasts.\nBacon of the best quality —al\nways on sale at E. 1). RUNDKI.L'S market.\nJLYTFRKSH OYSTERS to-day, at E. D.\nRuiuleli's.\nJfTf*A room for rent in Patton's Block, over\nJacob's store. Apply to J. G. Patton,\nHOOKS !\nat\nWill open to-morrow an IM\nMENSE STOCK of Standard\nand Miscellaneous\nBOOKS!\nFamily Bibles, Sunday School\nBooks, and other goods for the\nholiday trade. Will be sold at\nAUCTION, commencing Satur\nday Evening Dec. 20.\nD. LYONS.\nNATHAN TIDD,\nDBAI.KR !■ ,\nPITTSTON, WILKES-BARRK, ANI)\nLOYAL SOCK COAL.\nInvites the patronage of hia old friends and the putt\nie*. generally- I shall keep a full assortment\nof all size*,\nARB NILAL.L, BKLI. AT\nLOWEST PRICES FOR CASH.\nYard and office, foot of Pine street, just south of\nCourt- House.\nAug. au jr. Tinrt.",
        "seq_num":"sn86081381",
        "state":"Pa",
        "date_field":"1879-12-19T00:00:00Z",
        "id":"7448201c-4cec-4b5a-a148-d7f54696e1a6",
        "_version_":1505521397798010880},
      {
        "city":"Towanda",
        "loc":"-76.443069458,41.7647781372",
        "text":". DAILY\nT< WANDA REVIEW.\nVOLUME I, NO. 112.\nBusiness Cards.\nX LVORD & SON,\nJOB PRINTERS,\nDAILY REVIEW OFFICE, Main street, To wan da Pa.\nBENTLY MEEKER,\nCLOCK IT WATCH-MAKER AND\nUEPAIIIEII. All at the lowest prices.\nMonroeton, Pa.\nDR. T. B. JOHNSON.\nPHYSICIAN AND SURGEON,\nOffice over H. V Porter's Drug Store, Residence\n•orner Maple and Second Streets,\nJOIIN VV. CODDING.\nA TTORNE Y-A T-LA W,\nOffice over Mason's old Bank.\n1863. 1879.\nPR IKE SR LIFE LN'SUIUXCE.\nWin. H. \\'incpnt,\nMnin-st, Towanda, I'a.\nLargest, Safest, Oldest and best companies repre\nsented. 17sept79.\nHENRY STREETER,\nATTORNEY & COUNSELOR AT LAW\nTOWANDA, PA.\nGW. RYAN,\n• CO UN T Y S UPER IN T END EN 7 .\nOffice Patton's Block.\nOD. KINNEY,\nA TTORNE Y-A T-LA W,\nOffice, corner Main and Pine Streets, Towanda, Pa.\n\\X/ ILIAMS & ANGLE >\nVY AT TO RNE YS-A T- LA W,\nOffice formerly occupied by W. Watkins.\nELSBREE & SON,\nA1 TO RNE YS-A T-LA W,\nSouth side Mercur Block, Towanda, Pa.\nN. C. KLSBKKK. I L. ELSKHKK.\nGREAT\nCROWDS\nContinually attend the\nAuction Sale\nOF FINE\nDry Goods\nn the store formerly occupied by J. L\nKENT, Moore's Block.\nThe stock comprises large lines of\nDRESS GOODS, CALICOES, DOMESTICS,\nTABLE LINENS, TOWELS and TOWELNG,\nFLANNELS, MARSEILLES and CROTCHET\nQUILTS, BLANKKTL, HOSIERY OK ALL\nKINDS, KNIT UNDERWEAR, GLOVES\nin great variety, LADIES SKIRTS,\nand CORSETS, UMBRELLAS and\nPARASOLS, RIBBONS, and\nRUCHES, COLLARS, and\nCUFFS, LACES, and\nVEILINGS, and\nFANCY GOODS\nand \"NOTIONS, FINE TABLE and POCKET CUT\nLERY. In fact everything found in a first\nclass store.\nNo old styles as in most Bankrupt stocks, th\nfoods having been purchased within the year.\nSales at 1 and 7 p. in., until stock is closed.\nLadies Especially invited. No reserve.\nD. LYONS.\nTO WAND A, PA., MONDAY AFTERNOON, DECEMBER 19, 1879.\nThe News Condensed.\nThe Bank of Virginia City, Nev., has'\nsuspeuded.\nAt a late hour last night it was feared\nBishop Haven could not revive.\nGen. Grant says he has not accepted the\nPresidency of the Nicaragua Canal Co.\nThe Pennsylvania railroad depot at\nTyrone was burned yesterday morning, J\nCause of tire, a defective Hue.\nThe thermometer indicated from 12 to\n34 degrees below zero iu the Ottawa val\nley, Canada, yesterday.\nThe Treasury Department has purchased\n318,000 ounces of silver bullion for the I\nUnited States Mint at Philadelphia.\nA whale 50 feet long got into Lynn Ha-j\nveil bay, Virginia, and getting out of the 1\nchannel was captured by some country\nmen.\nGovernor Hoyt thinks Don Cameron's i\nappointment to the chairmanship of the\nNational Committee will give Pennsylva\nnia to the Republicans next fall by a ma\njority of one hundred thousand.\nMcCabe, who contests Orth's seat in\nthe National House from the 9t h Indiana >\ndistrict, has filed his petition ; he sets forth\nfraud and intimidation, bribery and illegal\nvoting.\nIt is stated in New York that Samuel\nJ. Tilden and Charles Butler, members of 1\nthe purchasing committee of the Saint\nLouis, Alton and Torre Haute Railroad\nCompany, have paid back SIOO,OOO each |\nto the road. A suit was pending against\nthem for the amount with interest.\nThe will of Christian Fundi, a lately\ndeceased member of a New York ship\nping linn, after large bequests to his\nbrother and sister, directs that his body\nbe embalmed, and taken in an iron collin i\nto Milan for cremation, and that the ash\nes be placed in an urn and buried at Co\npenhagen.\nA great many Democratic papers are\nridiculing l'resideut Hayes for lacking iu\nbackbone, because, as they allege, he has\nnot carried out his original Southern '\npolicy. It sometimes requires a great j\ndeal more \"backbone\" to make an orderly i\nretreat than it does to be a mule, anil !\nget slaughtered.\nA little boy in Paterson, N. J., had an i\nexciting but dangerous ride on the cow\ncatcher of a locomotive the other day.—\nHe stood looking at a passing train when\nthe cow-catcher of a switch engine gent\nly knocked him down, picked him up and\ncarried him a distance of thirty feet. lie\nwas not injured seriously, but don't want\nany more of tliat kind.\nJosephine Taylor, aged 22 years, daugh\nter of the president of the Mormon\nChurch, attempted to escape from Utah\nand her father's harem. She boarded a\nUnion Pacitic train, but having neither\nticket nor money was put off at the lirst\nstation east. She endeavored to persuade\nthe station agent to secrete her but he re\nfused and she was taken back to her fa\nther.\nStephen A. Douglas, the son of the Illi\nnois statesman of that name, for many\nyears a resident of North Carolina, and\nlately admitted to the bar at Chicago, at\ntributes the negro exodus from North\nCarolina to low wages and the desire of\nthe freedinen to educate their childern.\nHe thinks the southern Republicans pre\nfer Grant for President, while the south\nern Democrats want Bayard.\nI THE PRESIDENTIAL YEAR.\nj TIIE LEADING AMERICAN NEWS\nPAPER.\"\nTHE NEW YORK\nTRI B U N E\nFOR 1880.\nI During the coming Presidential year The Tribune\nwill be it more effective agency tlian ever for telling\n! the newH best worth knowing, and for enforcing\nsound polities. From the day the war closed it has\nbeen most anxious for an end of sectional strife.\nBut it saw two years ago, and was the first persist\nently to Proclaim the new danger to the country\nfrom the revived alliance of the Solid South and\nTammany Hall. Against that danger it sought to\nrally the old party of Freedom and the Union. It\n! began by demanding the abandonment of personal\n' dislikes, and set the example. It called for an end\n; to attacks upon each other instead of the enemy;\nand for the heartiest agreement upon whatever fit\n| candidates the majority should put up against the\ncommon foe. Since then the tide of disaster lias\nbeen turned back; every doubtful state has been\nwon, and the omens for National victory were never\nmore cheering.\nTHE TRIBUNE'S POSITION.\nOf The Tribune's share in all this, those speak\nmost enthusiastically who have seen most of the\nstruggle. it will faithfully portray the varuing\nphases of the campaign now beginning. It will\nearnestly strive that the party of Freedom, Union\nand I'ublie Faith may select the man surest to win,\nand surest to make a good President. But in this\ncrisis it can conceive of no nomination this party\ncould make that would not be preferable to the best\nthat could possibly be supported by the riolid South\nand Tammany Hall.\nThe Tribune is now spending much labor and\nmoney than ever before to hold the distinction it lias\nenjoyed of the largest circulation among the bent\npeo/ile. it secured, and means to retain it, by be\ncoming the medium of the best thought and the\nvoice of the best conscience of the time, by keeping\nabreast of the highest progress, favoring the freeest\ndiscussion*, hearing all sfdys, appealing always to\nthe best intelligence and the purest morality, and re\nfusing to carter to the tastes of the vile or the preju\ndices of the ignorant.\nSPECIAL FEATURES.\nThe distinctive features of The Tribune are known\nto everybody. It gives all the news. It lias the\nbest correspondents, and retains them from year to\nyear, It is the only paper that maintains a special\ntelegraphic wire of its own between its office and\nWashington. Its scientific, literary, artistic and re\nligious intelligence is the fullest. Its book reviews\nare the best. Its commercial and financial news is\nthe most exact Its type is the largest; and its ar\nrangement the most systematic.\nTHE HEM I-WEEKLY TRIBUNE\nis by far the most successful Semi-Weekly in the\ncountry, having fonr times the circulation of any\nother in New York. It is especially adapted to the\nlarge class of intelligent, professional or business\nreaders too far from New York to depend on our\npapers for the daily news, who nevertheless want\nthe editorials, correspondence, book reviews, scien\ntific matter, lectures, literary miscellaney, etc,, for\nwhich The Tribune is famous. Like The Weekly\nit contains sixteen pages, and is in convenient form\nfor binding, •\nTHE WEEKLY TRIBUNE\nremains the great favorite of our substantial country\npopulation, and lias the largest circulation of any\nWeekly issued from the office of a Daily paper in\nNew York, or, so far as we know, in the United\nStates. It revises and condenses ail the news of the\nweek into more readable shape. Its agricnlturai de\npurtracnt is more carefully conducted than ever, and\nit lias always been considered the best. Its market\nreports arc the official standard for the Dairymen's\nAssociation, and have long been recognized author\nity on cattle, grain and general country produce.\nThere are Special departments for the young and for\nhousehold interests; the new handiwork department\nalready extremely popular, gives unusually accurate\naud comprehensive instructions in knitting, crochet\ning, and kindrid subjects; while poetry, fiction and\nthe humors of the day are all abundantly supplied.\nThe verdict of the tens of thousand old readers who\nhave returned to it during the past year is that they\nfind it better than ever. Increasing patronage and\nfacilitias enable us to reduce the rates to the lowest\npoint we have ever touched, and to ofier the most\namazing premiums yet given, as follows:\nTERMS OF THE TRIBUNE,\nPostage fret in the United States.\nDAII.Y TRIBUNE $lO 00\nTHE SEMI-WEEKLY TRIBUNE.\nSingle copy, one year $3 00\nFive copies, one year 2 50 each\nTen copies, one year 2 00 each\nTHE WKKKIY TRIBUNE.\nSingle copy, one year $2 00\nFive copies, one year 1 50 each\nTen copies, one year • 1 00 each\nAnd number of copies ot either edition above ten\nat the same rate. Additions to clubs may be made\nat any time at club rates. Remit by Draft on New\nYork, Post Office Order, or in Registered letter.\nAN AMAZING PREMIUM.\nTo any one subscribing for The Weekly Tribune\nfor five years, remitting us the price, $lO, and $2\nmore, wc will send Chamber's Encyclopaedia, wn~\nabridged, in fourteen volumes, with all the revisions\nof the Edinburgh edition of 1879, and with six ad\nditional volumes, covering American topics not fully\ntreated in the original work;—the whole embracing,\nby actual printer's measurement, twelve per cent\nmore matter thun Appleton's Cyclopaedia, which\nSells for $80! To the 15,000 readers who procured\nfrom us the Webster Unabridged premium wc need\nonly say that while this offer is even more liberal,\nPRICE ONE CENT.\nwe shall carry it out in a manner equally satisfactory.\nThe following are the terms in detail:\nFor sl2, Chamber's Encyclopaedia, A Library of\nUniversal Knowledge, 14 vols., with editions os\nAmerican subjects, 6 separate vols,, 20 vols, in all,\nsubstantially bound in cloth, and The Weekly Tri\nbune .i years, to one subscriber.\nFor $lB, Chamber's Encyclopaedia, 20 vols., as\nabove, and The Semi-Weekly '1 ribune 5 years.\nFor $lB, Chamber's Encyclopedia, 20 vols., as\nabove, and ten copies of The Weekly Tribune one\nyear.\nFor $27, Chamber's Encyclopaedia, 20 vols, as\nabove, and twenty copies of The Weekly Tribune\none year.\nFor $26, Chamber's Encyclopaedia, 20 vols., as\nabove, and the Daily Tribune two years.\nThe books will in all cases be sent at the subscri\nber's expense, but with no charge for packing. We\nshall begin sending them in the order in which sub\nscriptions have been received on the Ist of January,\nwhen ceriainly live, and perhaps six, volumes will\nbe ready, and shall send, thenceforth, by express or\nmail, as subscribers may direct. The publication\nwill continue at the rate of two volumes per month,\nconcluding in September next,\nA MAGNIFICENT GIFT!\nWorcester's Great Unabridged Dictionary\nFree!\nI'he New York Tribune will send at subscriber's\nexpense for freight, or deliver in New York City\nFUKK, Worcester's (Ireat Unabridged Quarto Illus\ntrated Dictionary, edition of 1879, the very latest and\nvery best edition of the great work, to any one re\nmitting\n$lO for a single five years' subscription in advance,\nor live one year subscriptions to The Weekly, or,\nsls for a single five years' subscription in advance'\nor live one year subscriptions to The Semi-\nWeekly, or, one year's subscription to Ths\nDaily, or,\n$.50 for a single three year's subscription in advance\nto The Daily Tribune,\nFor one dollar extra the Dictionary can be sent\nby mail to any part of the United Bfates, while for\nshort distances the expense is much cheaper.\nAddress\nTHE TRIBUNE, New York.\n1831. THE CULTIVATOR 1880.\nAND\nCountry Gentleman.\nThe Best of the\nAGRICULTURAL WEEKLIES.\nIt is UNSURPASSED, if not UNEQUAI.ED, for the\nAmount and Variety of the I'HACTICAL INFORMA\nTION it contains, and for the Ability and Extent of\nits CORRESPONDENCE—in the Three Chief Directions\nof\nFarm Crops and Processes,\nHorticulture and Fruit-Frowing,\nLive Stock and Dairying—\nwhile it also includes all minor depatmentsof rural\ninterest, such as the Poultry Yard, Entomology,\nHee-Kecping, Green house and Grapery, Veterinary\nReplies, Farm Questions and Answers, Fireside\nReading, Domestic Economy, and a summary o\nthe News of the Week. Its MARKET REPORTS are\nunusuully complete, and more information ean be\ngathered from its columns than from any other\nsource with regard to the Prospects of the Crops, as\nthrowing light upon one of the most important of all\nqnestions— When to Buy and Jl'Acn to Sell. It is\nliberally illustrated, and constitutes to a greater\ndegree than any of its contemporaries A LIVE\nAGRICU LTU RA L NEWBP A PER\nOf never-failing interest both to Producers and Con\nsumers of every class.\nThe COUNTRY GENTLEMAN I published Weekly\non ths following terms, when paid strictly in ad\nvance: One Ccpy, one year, $2.50; Four Copies,\n$lO, and an additional copy for the year free to\nthe sender of the Club • Ten Copies, S2O, and an\nadditional copy for th year free to the sender of\nthe Club.\nFor the year 1880, these prices include a copy of\nthe ANNUAL RKOISTEROF RURAL AFFAIRS, to each\nsubscriber—a book of 144 pagcß and about 120 ne\ngravings—u girt by the Publishers.\nAll NEW Subscribers for 1880, payirg in ad\nvance now, will receive the paper WEEKLY, from\nreceipt of remittance to January Ist, 1880, with\nout charge.\n♦J\" Specimen copies of the paper free. Address\nLU 1 HER TUCKER & BON, Publishers,\nAlbany, N. Y.\nJ^OR\nHaii' Cut and ghave\nGo to the\nWARD HOUSE SHAVING PARLOR\nSTEDGE\nIs there.",
        "seq_num":"sn86081381",
        "state":"Pa",
        "date_field":"1879-12-19T00:00:00Z",
        "id":"d863a300-6596-4f9c-8e63-5a3da7f1489c",
        "_version_":1505521397641773056},
      {
        "city":"Towanda",
        "loc":"-76.443069458,41.7647781372",
        "text":"DAILY\nT< (WANDA KEYIEW.\nVOLUME I, NO. 116.\nBusiness Cards.\nALVORD & SON,\nJOB PRINTERS,\nDaily Revikw Office, Main street, Towanda Pa.\nBENTLY MEEKER,\nCLOCK dt WATCII-MAKEII AND\nREPAIRER. All at the lowest prices.\nMonroeton, Pa.\nDR. T. R. JOHNSON,\nPHYSICIAN AND SURGEON,\nOffice over H. C Porter's Drug Store, Residence\neorner Maple and Second Streets,\nJOHN W. CODDING,\nA TTOIiNEY-A T-LA W,\nOffice over Mason's old Bank.\n1863. 1879.\n$r LIFE\n\\V 111 - S. Vincent,\nMain-st, Towanda, Pa.\nLargest, Safest, Oldest and best companies repre\nsented. 17sept79.\nHENRY STREETER,\nATTORNEY & COUNSELOR AT LAW\nTOWANDA, PA.\nGW. RYAN,\n• o O UN T Y S UPER IN TEND EN I.\nOffice Patton's Block.\nOD. KINNEY,\nA TTORNE Y-A T-LA U\nOffice, corner Main and Pine Streets, Towanda, Pa.\nXT YILIAMS & ANGLE,\n> Y Y AT TO RNE YS-A T- LAW.\nOffice formerly occupied by W. Watkins.\nELSBREE & SON,\nA1 TO RNE YS-A T-LA W.\nSouth side Mcrcur Block, Towanda, Pa.\nN. C. Elsbkek. I L. Elsbbee.\nGREAT\nCROWDS\n*\nContinually attend the\nAuction Sale\nOF FINE\nDry Goods\nn the store formerly occupied by J. L\nKENT, Moore's Block.\nTlio stock comprises large i nes of\nDRESS GOODS, CALICOES, DOMESTICS,\nTABLE LINENS, TOWELSund TOWELNG,\nFLANNELS, MARSEILLES and CROTCHET\nQUILTS, BLANKET!., HOSIERY OF ALL\nKINDS, KNIT UNDERWEAR, GLOVES\nin great variety, LADIES SKIRTS,\nand CORSETS, UMBRELLAS and\nPARASOLS, RIBBONS, and\nRUCHES, COLLARS, and\nCUFFS, LACES, and\nVEILINGS, and\nFANCY GOODS\nand NOTIONS, FINE TABLE and POCKET CUT\nLERY. In fact everything found in a first\nclass store.\nNo old styles as in most Bankrupt stocks, th\ngoods having been purchased within the year.\nSales at 1 and 7 p. m., until stock is closed.\nLadies Especially invited. No reserve.\nD. LYONS.\nTOWANDA, PA., WEDNESDAY AFTERNOON, DECEMBER 24, 1879.\nThe News Condensed.\nCongressman Atkins, of Tennessee is\nseriously ill,\nTwo negro murderers have been lynch\ned in Russell county, Alabama,\nj Tennessee's Republican Legislators are\nfor Grant.\nFlood, the bonanza king, is to retire\nfrom stock operations.\nChicago's striking stock-yard men have\nresumed work, the packers having acced\ned to their demands.\nOuray failed to bring in the hostile\nUtes, and will help the Government to\nlight them.\nAmerican brigatine Nellie Wave of\nNew York is reported lost at sea; all\nhands perished.\nAttorney General Palmer has decided\nthat Building Associations are subject to\ntaxation.\nThe latest presidential ticket is Grant\ni and Mahone. Reliable Virginia gentle\nmen say tiiat it would carry that State.\nMr. P. Say, owner of the yacht Henri\netta, is in Baltimore, from w hence he will\nstart 011 a voyage around the Globe.\nThomas R. Pickering has been appoint\ned agent on behalf of the Government to\nsolicit contributions for the Melbouru\nExposition.\nIn the lottery cases before the Supreme\nCourt at Washington, the action of the\nj Postmaster General lias been sustained\nfor the present.\nEx-Govcruor Morrill of Maine, says,\n\"Our good State must be saved from the\n1 infamy now threatened by the \\ ile schemes\nofits rulers.\"\nThe demand for Pennsylvania coal is\n1 unprecedenedt in the history of the trade;\nthe market will take 6.000,000 tons 111 ex\ncess of the production in IS7B.\nA cave, said to present many attractive\nfeatures as a natural curiosity, has been\ndiscovered near Pequea Station, 011 the\nlino of the Quarryville Railroad, Lancas\nter county.\nThere is continued indignation in Maine\n' over the counting out of the Republican\nI Legislature. President Hayes does not\nbelieve the fusiouists can withstand the\ntide of opposition.\nThe Managers of the National Temper.\n' anee Society have issued an appeal to the\nwomen of New York and vicinity not to\noffer intoxicating drinks to their guests\non New Year's day.\nThe Post Office Department has added\nto its \"black list\"' the names of several\npersons and linns to whom either the\ndelivery of registered letters or the\npayment of money orders is forbidden.\nSenator Edmunds submitted a motion\n! to advance on the Lulled Slates Supreme\nCourt docket cases involving the validity\nof the act of Congress forbidding further\nretirement of the so-called legal-tender\nnotes and requiring them to be reissued\nand kept in circulation.\nThe Low-tax Democrats of the Tenne\n, ssee Legislature, at a caucus Monday\nnight, adopted resolutions recognizing\nbut one Democratic party in the State,\nand asking Democrats without regard to\nj diffbranee of opinion, to secure the nom\nination of candidates for State and Na\"\ntional officers on the low-tax platfoefh.\nj NO REVIEW TO MORROW.\nP~OR THE FIt&SIDESTIAL YEAR.\nJL\n\" THE LEADING AMERICAN XEWS\nPAPEIi.\"\nTIIK NEW YORK\nTRI BUNE\nFOR 1880.\nDuring the coming Presidential year The Tribune\nwill be a more effective agency than ever for telling\nthe news best worth knowing, and for enforcing\nsound politics. From the day the war closed it lias\nbeen most anxious for an end of sectional strife.\nBut it saw two years ago, and was the iirst persist\nently to Proclaim the new danger to the country\nfrom tins revived alliance of the Solid South and\nTammany Hall. Against that danger it sought to\nrally the old party of Freedom and the Union. It\nbegan by demanding the abandonment of personal\ndislikes, and set the > xainplc. It called for an end\nto attacks upon each other instead of the enemy;\nand for the heartiest agreement upon whatever tit\ncandidates the majority should put up against the\ncommon foe. Since then the tide of disaster has\nbeen turned back; every doubtful state has been\nwon, and the omens for National victory were never\nmore cheering.\nTHE Till RUNE'S POSITION.\nOf The Tribune's share in all this, those speak\nmost enthusiastically who inn e seen most of the\nstruggle. It will faithfully portray the varning\nphasei of the campaign iiou beginning. It wili\nearnestly strive that the party of Freedom, Union\nand l'ublie Faith may select the man surest to win,\nand surest to make a good President. Rut in this\ncrisis it can conceive of no nomination this party\ncould make that would not be preferable to the best\nthat could possibly be supported by the Solid South\nand Tammany llall.\nTito Tribune is now spending much labor and\nmoney than ever before to hold the distinction it lias\nenjoyed of the largest circulation among the best\npeople. It secured, anil means to retain it, by be\ncoming the medium of the hot thought and the\nvoice of the best conscience of the time, by keeping\nabreast of the highest progress, favoring the freeest\ndiscussions, hearing all sales, appealing always to\nthe best intelligence and 'hi purest nv \"a;. y. ate! re\nfusing to carter to the tie ;os of the vile or the preju\ndices of the ignorant.\nSPECIAL FEATURES.\nThe distinctive feat ures of The Tribune are known\nto everybody. It gives all the news, ii hits the\nbest correspondents, and retains them from year to\nyear, It is the only paper that maintains a special\ntelegraphic wire of its own between its . dice a id\nWashington. Its scientific, literary, artistic and re\nligious intelligence is the fullest. Its book review\nare the best. Its commercial and financial news is\nthe most exact Its type is the largest; and its ar\nrangement the most systematic.\nTHE SFMI-WEEKLY TRIBUNE\nis by far the most successful Semi-Weekly in the\ncountry, having four times the circulation of any\nother in New York. It is especially adapted to the\nlarge class of intelligent, professional or business\nreaders too far from New York to depend on our\npapers for the daily news, who nevertheless want\nthe editorials, correspondence, book reviews, scien\ntific matter, lectures, literary niiseelhiney, etc,, for\nwhich The Tribune is famous. Like The Weekly\nit contains sixteen pages, and is in convenient form\nfor binding,\nTIIK WEEKLY Till RUN F\nremains the great favorite of our substantial country\npopulation, and lias the largest circulation of any\nWeekly issued from the office of a Daily paper in\nNew York, or, so far as we know, in the Unit d\nStates. It revises and condenses all the news of the\nweek into more readable shape. Its agricultural dc\npertinent is more carefully conducted than ever,and\nit has always been considered the best. Its market\nreports are the official standard for tlio Dairymen's\nAssociation, and have long been recognized author\nity on cattle, grain and general country produce.\nThere are special departments for the young and for\nhousehold interests; the new handiwork department\nalready extremely popular, gives unusually accurate\nand comprehensive instructions in knitting, crochet\ning, and kindrid subjects; while poetry, fiction and\nthe humors of the day arc all abundantly supplied.\nThe verdict of the tens of thousand old readers who\nhave returned to it during the past year is that they\nfind it better than ever. Increasing patronage and\nf.icilitias enable us to reduce the rates to the lowest\npoint \\\\e. have ever touched, and to offer the most\namazing premiums yet given, as follows:\nTERMS OF THE TRIBUNE,\nPontage free in the United State n.\nDAILY TKIBUNK $lO oo\nTin: SEMI-WEEKLY TKIBUNK.\nSingle copy, one year no\nFive copies, one year 2 fill each\nTen copies, one year 2 00 each\nTHE WEEKLY TKIBUNK.\nSingle copy, one year $2 00\nFive copies, one year 1 50 each\nTen copies, one year I oo each\nAnd nutubi ;• of copies of either edition above ten\nat the same rate. Additions to clubs may be made\nat any time at Hub rates. Remit by Draft on New\nYork, l'ost Office Order, or in Registered letter.\nAN AMAZINO PREMIUM.\nTo any one subscribing for The Weekly Tribune\nfor five years, remitting us the price, $lO, and $2\nmore, we will send Chamber'# Encyclopaedia, wn~\nabridged , in fourteen volumes, with all the revisions\nof the Edinburgh edition of 1879, and with six ad\nditional volumes, covering American topics not fully\ntreated in the original workthe whole embracing,\nby actual printer's measurement, twelve per rent\nmore mutter than Apple ton* n Cyclopaedia which\nsells for $80! To th 15,000 readers who procured\nfrom us the I? < bate?' /„ Hcibvidged premium we need\nonly say that while this otter is even more liberal,\nPRICE ONE CENT.\nwe shall carry it out in a manner equally satisfactory.\nThe following are thfe terms in detail: *\nFor sl2, Chamber's Encyclopaedia, A Library of\nUniversal Knowledge, 14 vols., with editions on\nAmerican subjects, 0 separate vo.s,, 20 vols, in all,\nsubstantially bound in cloth, and The Weekly Tri\nbune 5 years, to one subscriber.\nFor $lB, Chamber's Encyclopaedia, 20 vols., as\nabove, and The Semi-Weekly Tribune 5 years.\nFor Chamber's Encyclopaedia, 20 vols., as\nabove, and ten copies of The Weekly Tribune one\nyear. A\nKor $27, Chamber's Encyclopaedia, 20 vols, as\nabove, and twenty copies of The Weekly Tribune\none year.\nFor S2G, Chamber's Encyclopaedia, 20 vols., as\nabove, and the Daily Tribune two years.\nThe books will in all cases be sent at. the subscri\nber's expense, but with no charge for packing. We\nshall begin sending them in the order in which sub\nscriptions have been received on the Ist of January,\nwhen eeriainly live, and perhaps six, volumes will\nbe ready, and shall send, thenceforth, by express or\nmail, as subscribers may direct. The* publication\nwill continue at the rate of two volumes per month,\nconcluding in September next,\nA MAGNIFICENT (J I FT!\nWorcester's Great Unabridged Dictionary\nFree!\nThe New York Tribune will send at subscriber's\nexpense for freight, or deliver in New York City\nFREE, Worcester's Great Unabridged Quarto Illus\ntrated Dictionary, edition of 1879, the very latest and\nvery best edition of the great work, to any one re\nmitting\n$lO for a single five years' subscription in advance,\nor five one year subscriptions to The Weekly, or,\n!?!•> for a single five years' subscription in advance'\nor live one year subscriptions to The Semi*\n\\\\ eckiy, or, one year's subscription to The\nDaily, or,\nS4O for a single three year's subscription in advance\nto 1 lie Daily Tribune,\nFor one dollar extra the Dictionary can he sent\nby mail to any part of the United States, while for\nshort distances the expense is much cheaper.\nAddress\nTHE TRIBUNE, New York.\n1831. TIIE CULTIVATOR 1880.\nANI\nCounti'y Crentleinan.\nThe Best of the\nAGRICULTURAL WEEK LlEv>.\nIt is UNSURPASSED, if not UNKQUALED, for the\nAmount and Variety of the I'HACTICAI, INFORMA\nTION it contains, and for the Ability and Extent of\nits CORRESPONDENCE—in the Three Chief I Mrections\nof\nFitnn Crops and Processes,\nHorticulture and Fruit-Frowiiig,\nLive Stock and Dairying—\nwhile it also includes all minor depatments of rural\nInterest, such as the Poultry Yard, Entomology,\nBee-Keeping, Green house and Grapery, Veterinary\nReplies, Farm Questions and Answers, Fireside\nReading, Domestic Economy, and a summary o\nthe News of the Week. Its MAKKET REPORTS arc\nunusually complete, and more information can be\ngathered from its columns than from any other\nsource with regard to the Prospects of the Crops, as\nthrowing light upon one of the most important of all\nquestions— When to Buy and When to Sell. It is\nlibel,illy illustrated, and constitutes to a greater\ndegree than any of its contemporaries A 1.1 VE\nAGRICULTURAL NEWSPAPER\nOf never-failing interest both to Producers and Con\nsumers of every class.\nThe COUNTRY GENTLEMAN is published Weekly\n°n the billowing terms, when paid strictly in ad\nvance: One t 'epy, one year, $2.50; Four Copies,\n$lO, and an additional copy for the year free to\nthe sender of the Club- Ten Copies, S2O, and an\nadditional copy for th year free to the sender of\nthe Club.\nFor the year 1880, these prices include a copy of\nthe ANNUAI. REUISTEROF RURAL AFFAIRS, to each\n; subscriber—a hook of 144 pages and about 120 ne\ngravings—a gift by the Publishers.\nMl NEW Subscribers for 18S0, paying in ad\nvance note, will receive the paper WEEKLY, from\nreceipt of remittance to January Ist, 1880, with\nout charge.\nSpecimen copies of the paper free. Address\nLUTHKIt TUCKER & SON, Publishers,\nAlbany, N. Y.\nF° B \"\"\"\"\n!\nllni i* Cut nnd Jf^liave\nGo to the\nWARD HOUSE SHAVING PARLOR\nSTEDGrE\nIs there.",
        "seq_num":"sn86081381",
        "state":"Pa",
        "date_field":"1879-12-24T00:00:00Z",
        "id":"5839408c-84f8-4ad6-baca-c7e289d4d2c2",
        "_version_":1505521397835759616},
      {
        "city":"Towanda",
        "loc":"-76.443069458,41.7647781372",
        "text":"The Daily Review.\nTowandaPa., Wednesday, Dec'r 24,1879.\nKDITOHB :\nS. W. ALVORD. NOBLE N. ALVORD.\n44 Daily Review\" only 25 cenlt per\nmonth. Try it.\nMails arrive depart and at the Towanda\nPost office follows.\nARRIVE.\nPhila. N. Y. and Eastern States. .4.00 A. M-\nDushore Laporte <fcc 9.30 44\nL. V. way mail from the North. .10.00 44\nSheshequin <fec 11.00 44\nNew Era &e Tues. Thur and Sat. 44 44\nAsylum &c Mon. Wed. and Fri. 44 44\nTroy Burlington &c 1.00 p. M.\nLeßaysville Rome <fcc 44 44\nClosed mail from Erie&N Cltlts 2.30 44\nL, V. way mail from the 50uth...4.30 44\nCanton Ac 5.00 44\nBarclay (5.30 44\nCl's'd mail fr'm Elmira & Erie II U10.40 44\nDEPART.\nCanton Monroeton &c 0.00 A. M.\nL. Y. way mail South 9.15 4 *\nCl's'dm,l ElmiraErie &NC It RIO.OO 44\nTroy Burlington &e 10.00 44\nSneshequin &c * 12.00 M.\nBarclay 1.00 P. M.\nNew Era Tues Thur and Sat.... 44 44\nAsylum Mon Wed and Fri 14 4 *\nLeßaysville Rome &c \" 44\nDushore Ac 2.45 44\nli. V. way mail North 3.45 44\nN Y Phil and Eastarn States... .7.45 44\nOffice open from 7.00 A. M. t07.45 p. M.\nMonev Order otliee open from 8.00 A. M. to\n7.00 p. M.\nOftiec open Sunday's from 0.00 to 10.00 A. M.\nP. POWELL, P. M.\nThe banks and business places will be closed\nto-morrow.\nMrs. SWEET can be found at STERN'S New\nYork Store, where her millinery orders will\nbe tilled.\nThe Postoffice will be open to-morrow from\n8:30 to 0, and from 10:30 to 11:30 A. M., and\nfrom 5 to (5 p. M.\nThe auction store is crowded all the time.\nMr. LYON will remain another week to give\neverybody the advantage of Bargains,\nThe Knights of Honor have put a very\nneat transparency out, to indicate their place\nof meeting.\nRemember the happiness that results from\ndoing a kind deed is far beyond any that may\nbe gained in the gratification of selfishness.\nThe third child of JOIIN MADDUX'S family\ndied of diphtheria yesterday. The little fel\nlow was a deaf mute.\nWe give more than our usual amount of\nreading matter to-day, and shall not issue the\nREVIEW to-morrow. We wish all our readers\nand everybody else a merry Christmas.\nMuLi.ocic.of JORDAN'S market, keeps the\nlargest and finest oysters ever offered in this\nmarket. Order some for your Christmas\ndinner.\nChurch of the Messiah, (Universalist) Rev.\nWM. TAYLOR, pastor, Christinas services,\nwith appropriate music, at 7 L*. M., on Christ\nmas day.\nThe boys and girls have enjoyed themselves\ncoasting for the past day or two. Chestnut\nstreet is the favorite resort for \"riding down\nhill.''\nIf you have the means and desire to make\nsuch presents on Christinas as will give you\npleasure all the year, send some poor neigh\nbor a sack of flour, or some other article of\nfamily consumption.\nThe death of Mr. JONATHAN STEVENS is\nannounced in another column, lie died at\nhis residence in Asylum, last evening. The\ndeceased was well known all through this\nsection, and was the father of our esteemed\ntownsman HENRY T. STEVENS.\nChristmas services will be held in Christ\nChurch to-morrow morning, at 10 1-2 o'clock,\nThe Rector wil preach a discourse appropriate\nto the day, after which the Holy Communion\nwill be administered. The interior of the\nchurch has been very handsomely trimmed\nwith evergreens.\nThe Christmas festival of Christ Church\nSunday School comes off this afternoon. The\ninfant school will meet at 3:30, and the main\nschool at 4 o'clock. The exercises will con\nsist of a portion of the church service, singing\nhymns, addresses by the Rector and Superin\ntendent, to be supplemented by a feast which\nthe ladies of the congregation are preparing.\nIt will prove an enjoyable occasion to teach\ners and scholars.\n, Mrs. SWEET can be found at STERN'S New\nYork Store, where her millinery orders will\n' be filled.\nMr. JONATHAN STEVENS, one of the oldest\nand most widely known inhabitants of this\ncounty, passed quietly away from suffering\non earth, to a Christmas in heaven, last even\n, I ing, at about 11 o'clock, at the advanced age\nof 70 years. Up to his present sickness,\nwhich attacked him about three weeks since,\nhe was one of the most healthy and vigorous\n1 1 of men; frequently walking to Towanda, (4\nmiles) to church and return.\nWith the many loved ones gone that way\ni before him, and \"with Christ which is better,\"\n| he has found that joy which he so earnestly\nlooked forward to, and wished \"it might soon\nI come.\"\nj liis funeral will take place on Friday, at\n|IOA, M. Services at the Universalist church,\nat Standing Stone. T.\nSuperintendent's Notes.\nTuesday, Dec. 23.—Visited the following\nschools and teachers of Rome district: Morley\nHill, F. Beloud, teacher, pupils registered 10,\npresent 14; Village, Emma Chambcrlin,\nteacher, registered 17, present 14; Union,\nChas. Allis,'teacher, registered 30, present3o;\nalso Rome Borough, W. H. Brown, teacher,\nregistered 51. present 40; Mycrsburg school,\nWysox, O. Tanner, teacher. All the schools\nseem to be succeeding well. F. Beloud,\nthough teaching his first term, is well liked by\nthe pupils, and is thorough and progressive.\nHeard fine grammar class in Village school.\nNoticed fine colored wall maps in Myers\nburg school, drawn by pupils, and prepara\ntion for the same in Union school. The\nBorough and Village schools are only a few\nrods apart, and should be united and graded.\nThe townshipand the borough mightcaeh pay\nits own ,teacher as at present, and then have\nall the advantages of a graded school.\nMr. Brown, though an excellent teacher,\ncannot do all that is necessary with so large a\nschool, and advanced classes.\nIf Xmas day on Thursday be,\nA windy winter ye shall see;\nWindy weather in each week.\nAnd hard tempests, strong and thick;\nThe summer shall be good and dry.\nCorn and basts shall multiply;\nThat year is good for lands to till;\nKings and princes shall die by skill;\nIf a child born that day shall be,\nTt shall happen right well for he;\nOf deeds he shall be good and stable,\nWise of speech and reasonable,\nWhoso that day goes thieving about,\nHe shall be punished without doubt;\nAnd if sickness that day betide.\nIt shall quickly from thee glide.\nPersonal.\nMiss MATTIE MAI.I.ORY is spending the\nholiday vacation school of with her parents in\nthis place.\nRev. A. TII.DEN. of East Smithlield, will\nspend Christmas in this place, as the guest of\nR. M. WELLES. He will preach in the Bap\ntist church on Friday evening, at 7 o'clock,\nand the public are invited to hear him.\nF. C. MCKEE, of the REVIEW job depart\nment, will spend Christmas with his uncle*\nDr. MCKEE, in Kingston.\nFRED SPALDING, a student at Lehigh Uni..\nversity, is speding the holidays with his\nmother.\nE. B. MCKEE, of the Graded School, is at\"\ntending the Luzerne County Teachers' Insti.\ntute this week.\nCHARLIE PORTER, JOS. POWELL, MAN\nVILLE PRATT, are home to eat their Christ\nmas dinners.\nHARRY MADII.L and JULIUS MASON, are\nspending vacation in town.\nMisses Lou and BESSIE WARD, of Syracuse,\nare spending the holidays in Towanda.\nHon. JAMES FOSTER is still in Lendville,\nand has placed us under obligations by for\nwarding copies of daily papers from that en\nterprising city. _ i\nSupt. RYAN is visiting the North Towanda j\nschools to-day.\nMrs. ANN MONOHAN, of Towanda town-1\nship, fell while coming down the stairs lead\ning to J. W. MIX'S office in Mercur block\nyesterday and injured herself quite seriously.\nOur esteemed friend and popular grocery-1\nman, JAMES MCCABE, realizes the fact that J\nprinters can enjoy a Christmas dinner as well |\nas other people, provided they have anything\nto eat, and has made provision in this respect\nfor us by sending a large plump turky. The\neditor and family will kindly remember him i\nwhile discussing the bird to-morrow.\nI\n1 Mrs. SWEET can l>e found at STERN'S New j\n' York Store, where her millinery orders will\nI be rilled.\nj (J. A. BLACK has lifted up an oliice on the\ns second floor of the building lately occupid by\n' the crockery store, where he will confine him\nself to the Sewing Machine and Insurance\n} business.\nf Country dealers will find it. to their advant-\nage to buy their candies at FITCH'S.\n[ GRIST MILL FOR SALE.—The subscriber\noffers for sale an undivided half interest in\n- the Globe Mills, near Towanda, and adjoin\n> ing Maj. HALF'S, with mill-house, barn and\nr other out buildings, and eight acres of land\n, connected therewith. The null has lately i\nbeen put in thorough repair, and is now doing\n- a splendid business—running day and night, j\nSaid half interest now rants for §>4so a year,\nclear of all expenses, and in good times j\nwould readily rent for $(>00. This is a rare ,\nopportunity for a profitable investment; j\nTerms, half cash, the balance on longtime.!\nJOSEPH G. PATTOX.\nFor a first class Hair Switch go to Mrs. M\n' A. FLETCHER'S, NO. 4, Bridge street.\nAsk for one of those dollar-and-a-half\nswitches, all Hair, 80 inches long, at No. 4,\nBridge street.\nPuffs with 18 inch hair, and one dollar, at\nNo. 4, Bridge street.\nDiamond, silver and snowflake powder for\nthe hair at No. 4, Bridge street.\nFspecial attention payed to the dressing of |\nladies hair for the Naiad and Lin-Ta balls,!\nat No. 4, Bridge street.\nSwitches to ronton special occasions, at No.\n4, Bridge street.\nFancy Hair Work a specialty, at No. 4,\nBridge street.\nA first class assortment of millinery goods\nat cost, can be found at No. 4, Bridge street,\nLOST. — A Bed Morocco Pocket-Book, con\ntaining about twenty-four dollars in bills and I\nchange, one note of forty dollars, with four\n: teen dollars endorsed, and other valuable i\ni papers, one watch-key, elastic cord. The'\nj tinder will be liberally rewarded by leaving\nthe above at D. W. SCOTT & Cor's or the i\nI owners,\nMrs. 1). T. FOSTER. 1\nWhen you start out to purchase candies, !\nfruits and confectionery, remember that'\nFITCH'S is headquarters for all those articles,!\nand you can rely upon getting a genuine arti- !\ncle. He manufactures most of his candy, and ;\nis enabled to furnish his customers fresh !\nstock.\nLOST. —oft' the hearse, on Wednesday,\nDecember 17th, between J. (). FROST'S SONS |\ni Furniture Store and Guyer's school house, a\n| Light liubbcr Coat. The finder will be liber- j\n| ally rewarded by leaving the same at J. O.\nFROST'S SONS.\nSEYMOUR SMITH.\nj AGENTS WANTED. —Enquire at the board\n! ing-house on Second street, lately occupied\nJ by Mrs. Dr. MASON.\nE. 1. WOODARI). J\nj FITCII has the best assortment of common j\n| and fine candies, including WHITMAN'S cele- |\nI brated confections, over offered in this market, j\n| Now is the time to make your Christmas pur\nj aliases.\nWANTS.\nUnder this head we will insert FREE, notices of\nsituations or help wanted.\nA good girl to do general housework, and\nplain sewing, at Bcnj. Kuykendall's, Poplar\nstreet.\nMrs CURRAN, on street, west of FROST'S\nFurniture factory, would like work at plain\nsewing, tailoring, carpet making, or washing\nand ironing.\nA young man of good moral habits wishes\na situation in a Dry Goods or Grocery store,\nthree years' experience. Good references i\nApply to the edttors of this paper.\nBUSINESS LOCALS\"\nThis NOTICE is intended to inform all per\nsons indebted to the late firm of MCINTYRK\n& RUSSELL that they must make immediate\npayment or costs will be made. The books\nand accounts are in the hands of\nJAMES WOOD, Attorney-at-law,\nTowanda, Pa.\nThe PARAGON School Desk is the best in\n| the market. Warranted not to get out of\nj order or break. Call at FROST'S SONS Fur\nniture Store and examine the same. tf\nIf you want the best vegetables, the largest\noysters, the best cuts of meat, and the finest\nI sausage to be found in Towanda, call on Mr.\nMULLOCK, at the old Market, just south of\nthe Ward House,\nBuiT* Geo Lynchcome has opened a new\nBarber Shop over Powell's store where he is\nalways ready to wait upon all those who may\nfavor him with their patronage. Shampooing\nhair cutting Ladies' and Children's hair at\nthe|r residence no extra charge.\nI\n: !H3f ' Jacobs is selling Overcoats all the way\nfrom $2 up to any price vou are willing to\n| Pay-\nCigars of about every known brand at\nFITCH'S.\nDon't put off your Christmas purchases\nuntil the last moment. FITCH has a full line\nof candies and confections, and now is the\ntime U> make\"your selections.\nMrs. FLETCHER is selling millinerv goods\nat cost.\nPrices way down in Gents line and coarse\nboots and shoes. All goods warranted as\nrepresented, at HU M'S.\nOn account of a change in my business,\nI will sell Millinery Goods at cost.\nMrs. M. A. FLETCHER,\nNo. 4 Bridge street.\nThe continued mild weather has induced\nROSKNFIKLD, the Clothing merchant, to re\nduce the price of Overcoats and other winter\nClothing. Call and secure bargains. There\nwill be plenty of cold weather yet.\nFor a good, durable and neat fitting shoe,\ngo to BLUM'S.\nPATCH BROTHERS pay 30 cents, in cash,\nfor pheasants, and the highest price for but\nter.\n!s3nf you want a stylish hat, cheaper than\nyou ever bought one, call at ROSENFIELD'B\nclothing store.\n®2tPClioioe Hams and Smoked Beef, at\nMYER & DKVOE'S market, Bridge Street.\nOVERCOATS HO cheap that you can afford to\nbuy two or three, at ROSENFIELD'S clothing\nstore. °\n®SF~AT MYER & DKVOE'S market is the\nplace to get tender steaks and nice roasts.\njjEiT'Myer & Devoe are receiving l'resh\nOysters daily, at their market, Bridge St.\nBt3T\"Buy your fresh fish at RUNDELL'S.\nJEITMYKH A DEVOE keep the largest and\nbest assortment of Fruits and Vegetables in\ntown.\nJESTGO to E. I). RUNDELL'S for the best\nSteaks and Roasts.\nBEST Genuine Bacon of the best quality—AL\nways on sale at E. D. RUNDELL'S market.\nOYSTERS to-day, at E. D.\nRundell's.\nA room for rent in Patton's Block, over\nJacob's store. Apply to J. G. Patton,\nBOOKS !\nat\nWill open to-morrow an IM\nMENSE STOCK of Standard\nand Miscellaneous\nBOOKS!\nFamily Bibles, Sunday School\nBooks, and other goods for the\nholiday trade- Will be sold at\nAUCTION, commencing Satur\nday Evening Dec. 20.\nD. LYONS.\nQOAL:\nNATHAN TIDD,\nDEALS II IE\nPITTSTON, WILKES - BARRE, AND\nLOYAL SOCK COAL.\nInvites the patronage of tils old friends and the pub\nlic generally- T shall keeps full assortment\nof all sizes,\nAND SHALL HELL AT\nLOWEST PRICES FOR CASH.\nYard and office, foot of Pine street, just south of\nCourt House.\nAug. 30 N. TIDD.",
        "seq_num":"sn86081381",
        "state":"Pa",
        "date_field":"1879-12-24T00:00:00Z",
        "id":"3d47d128-0259-4e51-9f33-4843f749263e",
        "_version_":1505521397876654080},
      {
        "city":"Towanda",
        "loc":"-76.443069458,41.7647781372",
        "text":"Security of Christianity.\nThe real security of Christianity is to\nbe found in itt benevolent morality, in its\nexquisite adaptness in the human heart,\nin the facility with whieli its scheme ac\ncommodates itselftothe capacity o'Yveay\nhuman intellect, in the consolation which\nit bears to the house of mourning, in the\nlight with which it brightens the great\nmystery of the grave. To such a system\nit can bring no addition of dignity and\nstrength, that is part and parcel of the\ncommon law. It is now for the first time\nleft to rely on the force of its own evi\ndence and the attractions of its own\nbeauty. Its sublime theology confounded\nthe Grecian schools in the fair conflict of\nreason. The bravest and wisest of the\nCiesars found their arms and their policy\nunavailing when opposed to the weapons\nthat were not carnal and t he kingdom which\nwas not of this world. The \\ ictory i\\ hich\nI'orphysy and Diocletian failed to gain is\nnot, to appearance, reserved for any of\nthose who have, in this age, directed\ntheir attacks against the last hope of the\nwretched. The whole history of Christ\nianity shows that it is in far greater\ndanger of being corrupted by the alliance\nof power than of being c-'tished by its op\nposition. Those who thrust the temporal\nsovereignty upon her, treat her as their\nprototypes treated her author. They bow\nthe knee and spit upon her, tuen cry\n\" Hail!\" and smite her on the cheek ; they\nbnt a cepter in her hand' but it is a fragile\nreed; they crown her. but it is with\nthorns; they cover her with purple, the\nwounds which their own hands have in\ndicted upon her; and inscribe magnificent\ntitles over the cross on which they have\nfixed her to perish in ignominy and pain.\n—Ma I'aulay.\nA curious story is told of the shipwreck\nof a large Hrithshcollier, which foundered\nfar out at sea, oil\" the coast of California.\nThe sole surnivor was a Portuguese sail\nor, by the name of Lopez, who was\npicked up lashed to a raft, as he drifted\nin the pat h of an inward bound vessel for\nPuget Sound. He was taken to the Ma\nrine Hospital at Port Towusend, and\nafter a week of skillful nursing he so far\nrecovered as to be able to relate his ex\ntraordinary adventure. He had floated\nwith a dozen companions helpless in the\nPacific. One after another of his ship\nmates died trorn thirst, until he was alone\nwith the last survivor, and as he was\ndying Lopez said to him, ''George, do\nyou think you are going to Ged?\" <)n re\nceiving an affirmative reply, Lopez added\nwith all the intenseness of despair,\n•' When you get where God is, tell him to\nsend us some water.\" The dying man\npromised that he won kl do so, and soon\nbreathed his last. Shortly after a copi\nous shower fell, and Lopez was enabled\nto hold out until rescued as stated above,\non the twenty-second day after the sink\ning of the ship.\nSome people begin matters at the wrong\nend. They say, \"If we love God, God\nwill love us.\" 1 can't think where they\nfind this. Their Bibles must be contrary\nto mine, for mine says, \"We love God\nbecause He first loved us.\"— Doudney.\nIf we are as willing to profit by the\nwisdom of others, as we think they ought\nto profit by our wisdom, we, and our\nfriends, would probably be much gratified\nby our improvement. But it is with\na marked absence of eagerness, not to say\nwith reluctance, that we accept the max\nims even of Divine wisdom, before our\nown experience has verified them.\n\"Judge not,\" is a familiar precept, but\nwe repeat it with our lips, and straight\nway indulge in seriousness.\nOh, sirs, whatever you do, take care\nthat you do not on anything but\nGod's Word, and that will bring in true j\ncomforts, solid comforts, holy comforts, 1\nlasting comforts, everlasting comforts.—\nKomaine.\nGod judgeth the rightous, and God is '\nangry with the wicked every day.— Bible.\n'j RIAL LIST, December term, 1879.\nSECOND WKKK.\nJuolm Chilson v* E W lacker appeal\nDaniel Hems ley vs Charles E Noble issue\nNathaniel Davison's ex'r vs J Leroy Corbin.. .asspt\nJoseph Towner vs. B W Lane ejectment\nShaw .V Co vs Andrew J Lay ton trespass\nCodding Jt Russell vs Towandu boro School dis.dbt\nPhenix Life Ins Co vs II A Burbank et al sei fa\nJackson Lewis vs William Whitney trespass\nSeth Doane's adm'r vs C W Donne trover\nWeller & Ellis vs Dennis McMahon's adm asspt\nS II Farnsworth vs J Cobb issue\nI> C DeWitt vs Hcliruder Coal Co trespass\nSarah Jordan vs Olive Fox Elliott issue\nF M Palmer vs Eugene Keeler appeal\nHarrison Biaek vs Xiram A Black \"eject\nWilliam M Keeler vs Barret Keeler asspt\nAndrew Pratt vs John Smiley appeal\nJ P Morton vs Robert Bennett et al asupj\nJ J Thompson vs W II Dunlnp... inq\n(' W Clap]> vs J W llolletiback et al trespass\nWilliam M l'iatt vs Charlotte Ward's ex'r... .asspt\nLydla Lewis' use vs l'eleg Peek's exrs asspt\nMargaret I> Kline's use vs David Luther et aL.tres\nJoe! Davis vs B Lacey Mo Artec asspt\nBC Hall ve William Brague aDpeal\nTIIIRI) WKKK.\nS Kirby vs 11 C Carpenter ejectment\nArthur Cunningham vs B J Ilouscknecht... .tresp\nCornelia Turk's nd'm vs J Turk sei fa\nAlexander Hnnis vs J X Cole appeal\nA V Snyder vs O S Ackley appeal\nEdward' Overton's adm vs Jolm Con nicy\nFrost's Sons vs Federal Ins Co asspt\nElizabeth Drake et al use vs S II Farnsworth.. .ejet\nBrad L it B A of Athens F \\ Root sei fa\nD B Walker et al vs l'a Jk X V RR Co ;ject\nOuy C Mollon vs Elbanan Smith appeal\nWin M Mallory vs James T Clark et a) ...partition\nJ C Blum vs Andrew J Layton trespass\n<' A Henvcner vs David llerveiicr's e.\\r asspt\nJ B Bradley v> Mou/.o Hill et al ejectment\nM Cunningham \\> David Whipple\nBrad B it LA of Athens vs N B Reeves sei fa\nDaniel .luggers vs Lewis Biles et al trespass\nWm H Barnes vs Wm May trespass\nHiram Morton's use vs Krustus Shepard.... .. .sei fa\ndo do do do..\ndo do do do..\n11 B Ingham vs James MeC'rossen\nCatherine I) Leffler vs Win Leti'ler et al issue\nL F Ooetehius vs Wm Gardner debt\nSuhpienas for second week returnable Monday\nDecember H at '2 p. in.; subpmnas for third week re\nturnable on Mondav December 15 at 2 p. m.\nGEORGE W BI.ACKMAX,\nTowanda Nov. 12 IK\"9. Prolhotiotary.\nGrroa I\nCROWDS!\nI\nat\nJ. L. KENT'S.\nand an\nIMMENSE STOCK !\nDRKSS GOODS.\nCLOAKS and SHAWLS,!\nGLOVES and HOSIERY.\n3 button Kid Gloves, only 75\nCents, worth a dollar.\nSHEETINGS & SHIRTINGS,\n7 .\nof the best brands, cheap !\nCLOTHS and CASSIMERES,:\nof all qualities and prices.\nRIBBONS & FANCY GOODS, |\nthe best selection ever offered\nin this market.\nFLANNELS & BLANKETS,\nin endless variety.\nIn fact my assortment of DRY\nGOODS is complete and is not\nexcelled by any establishment in\nthe country. In prices\nI DEFY COMPETITION !\nand cordially invite inspection of j\nmy goods and a comparison oL\nprices.\ntfcjr* Col. Means' mammoth\nstore, second door south of Mc.!\nIntyre Brothers hardware store, j\nT. I;. KENT,\nNov. 14. Agent.\nV ertical\nFeed.\nAs usual, the Vertical Feed\nSewing Machine took First Pre\nmium, at the late county Fair.\nA*\nOverwhelming Stock\nOK KVKUYTIIING IS\nMllline ry,\n\\otionn and\nFa n cy Goods\n/\nLINE AT\nMRS. S. H. SWEET.\nOne door south of Evan* A llildrcth's, Main\nStreet.\nHaving learned by experience where\n. bargains ran be found. I mean to maintain m\\\nreputation in the future as in the past, and\nthose who desire real bargains should see\nwhat I have secured at the sales the past week\nin New York.\nAirs. Sweet takes great pleasure in aimoutic\ning to the ladies that she gives personal atten\n, tion to trimming hats, and by long experience\nflatters herself that she can give satisfaction\nCALL AND SEE,\nAND BE ASTONISHED AT\nLow Prices.\nMRS. S. 11. SWEET.\nSept. 30.\nText Boole (hiiformity.\nRESULT WHERE BOOKS HAVE TO\nSTAND ON THEIR OWN MERIT.\nAt a Convention of School Directors, of\nCentre County, held a Bellefonte, Decem\nber 2G, 1878, pursuant to the call of 11.\nMeyer, Esq., County Superintendent, for\nthe purpose of considering the propriety\nof taking measures to secure a uniformity\nof the text-books used in the schools of\nsaid county, the following action was\ntaken, over fifty directors being present\nand nearly all the district in the county\nbeing represented:\nCOPY OF MINUTES.\nUpon motion of C. P. Stonerod, of Snow\nShoe township, the following preamble and\nresolutions were adopted:\nWHKKKAS: Great expense and waste are\nfrequently incurred by the present and con\nnstat.lv changing variety of text-books used in\nthe common schools of Centre county, there\nfore, be it\nResolved, By the representative directors\nhere in session, that a system of text-books,\nsuitable, complete and uniform, be adopted in\naccordance with the laws of the State,\nthroughout the eountv. '\nUpon motion of J. C. P. Jones, the follow\nmg plan was adopted with but one dissenting\nvote, to carry into effect the following pre\namble and resolutions:\nFirst. The various publishing houses to\nsend samples of their books to each school\nboard in tnc county for examination and to\n.submit therewith the lowest exchange, intr -\nduetory and wholesale prices, and the length\nof time they will guarantee to furnish them\nat said price.\niSecond. No agent of any publtshing house\nto be permitted to do any work in the county,\nto be either general or local agent, beyond\nsending his books and terms as above stated.\nAny house or agent violating this under\nstanding, their books to be counted ou of the\ncontest.\nThird. The several school boards of the\ncounty, after examination of the various\nbooks which may have been submitted, to\nhold a meeting at which each director shall\nmake out a list of the books which he prefers\nto have adopted in the county, and se d it to\nHenry Meyer, Esq., Countv Superin n dent,\nltebersburg, Pa., prior to the first day of\nJune, 1ST!), who shall male a , ass . e\nseveral statements so sent, and the books up\non the various branches having tin ighest\nnumber of votes or preference shall be the\nseries recommended for county uniformity.\nThe County Superintendent, afrer having\nmade the above canvaos as above, to smd the\nresult of the same to each of the papers in the\ncounty for publication.\n, ~ . W. C. HEINLE, Chairman.\nJ. b. P. JONES, Secretary.\nThe following is the result of the votes\nof the Directors of Centre county, Pa., ou\nthe uniformity of Text-books in said\ncounty, with the number of votes cast fro\neach book, under the foregoing plan and\nresolutions:\nRE ADER.s. No. vote.\n, , for eaesh\nNew Graded 74\nIndependent 20\nAppleton's .'. 17\nNew American 12\nSPELLERS.\nSwinton's qg\nNew American g\nIndependent 23\nAppleton's 1\nPatterson's\nSander's Union [[[\nRaub's * j\nGEOGRAPHIES.\nSwinton's inn\n(Jolton's * 14\nMitchell's JJ\nIndependent 1\nMonteith's .\"\" g\nHISTORIES.\nSwinton's\nRedpath's 5\nBarnes' Brief *\" 7\nButler's '.. ....]]\nOuackenbos' 1\nWatson's j'.\" Q\nV R ITT EN ARITHMETIC.\nRobinson's Shorter Course 57\n• Greenleaf's 14\nBrook's * _\nGillie's \"\" on\nBotT's ;;;;;;;\nN rook's Union ' g\nMew American\nMENTAL ARITHMETIC.\nMilne's 7\nGreenleafs .*!!.\"!!.'!!.' 4\nALGEBRA.\nRobinson's gg\nGreenleafs ]\nCOPY BOOKS.\nSpencerian gg\nAppleton's ok\nEllsworth's ;;;;;; | 0\nGRAMMARS.\nKerl's 72\nSwinton's .!.!!* 1*\nClark's Brief If ,\nBULLION'S ;;;;; ?\nHarvey's >o\nOuackenbos'\nkewsmith's 1\nLANGUAGE LESSONS.\nKerl's *\nClark's r\nHarvey's., .!!!!!!! 1\nMortoii's ►\nBOOK-KEEPING.\nBryant A Stratton's 44\nFolsom's \"*\nSmith's\nCIVIL GOVERNMENT.\nTownsend's.. -\nBOTANY.\nGray's\nSteele's 7\nGEOLOGY.\nDana's gg\nDRAWING.\nWhite's Industrial 4.\nPHYSIOLOGY. \"\nSteele's Q\ncutter's *\nNATURAL PHILOSOPHY.\nSteele's s 2\nThe attention of Directors is called to\nSection LXII of the School Laws, which\nrequires every School Board in the State\no adopt a series of Text-books every\nyear, during vacation, which books, and\n110 others, can be used during the ensuing\nschool year. This is intended to tlx %\nuniform course of study for the school 01\neach district.\nThe undersigned having been appoint\ned a Committee to count the vote on\ncounty uulfonnity of Text-books in Cen\ntre county, respectfully report that\nthey have carefully performed such duty\nand that the foregoing is a correct can\nvass of the same.\nSAMUEL FRANCE,\nJ A RED HARPER,\n~ . W. C. HEINLE'\nCommittee appointed by the County\nSuperintendent to canvass the votes\nBELLKKONTK. PA., June 23, 1879.",
        "seq_num":"sn86081381",
        "state":"Pa",
        "date_field":"1879-12-13T00:00:00Z",
        "id":"6edb6231-58f3-4555-a1d4-f21262e088bb",
        "_version_":1505521397942714368},
      {
        "city":"Towanda",
        "loc":"-76.443069458,41.7647781372",
        "text":"QOAL I COAI, I\nCHEAPFOR CASH !\nThe following prices will be charged for w4JY- j\nTU&.iCMTfi COmlh in the yard, in all the\nyards signatures hereto attached, until furthe\nnotice:\nSTOVE, $4 25\nCHESTNUT, 4 25\nGRATE, 4 25\nEGG, 4 25\nXT Cartage, FIFTY CENTS PER TON IN\naddition to above, and an EXTIiA CHARGE for\ncarrying in.\nW. M. MALLORY, Towanaa.\nHENRY MERCUR,\nNATHAN TIDD,\nK. B. PIERCE, \"\nBARTLETT BROS., Wysox.\nAt ATmHHOR P.*D, formerly l'hin\nney's:\nSullivan Coal,\nLARGE STOVE , FV 00\nSMALL STO VE, 3 25\nCHESTNUT; 3 25\nEGG, 3 00\nGRATE, 3 00\nSMALL CHESTNUT, 2 5\nWith same additional charges for cartage.\nW. M. MALLORY.\nOctober, 24, 1879.\n50th YEAR\nof\nB GODEY'S LADY'S BOOK.\nThe oldest and Best Fashion Magazine\nin America.\n|\nSUBSCRIPTION PRICE\nREDUCED TO $2.00 PER YEAR.\nSubscriptions will be received at this Office ia\nClubs with this Paper.\nThe DAILY REVIEW and Godey's Lady's I\nBook for one Year at $4.50.\nSee what Godev's Ladv's Book will Contain I\nIN I*SBO.\nNearly 1200 pages of first-elans Literary matter.\n12 Steel Plate Beautiful Original Engravings.\n12 Large and Elegantly Colored Fashion Plates.\n24 Pages of Vocal and Instrumental Music.\n900 Engravings, on Art, Science, and Fashion.\n12 Large Diagram Patterns of Ladies' and Chil- j\ndren's Dresses.'\n12 Architectural Designs for Beautiful Homes.\n200 ur more Original Receipts for Family Use.\nAnd the usual Original Department matters.\nThe .January No. of the NewfiYear will be issued\nDecember rst, and will contain\"the open n g chap\nters of one of the Best Serial Stories ever printed in\nAmerican Magazine, by\nCHRISTIAN RKID,\nthe author of \" A Gentle Belle,\" \" Valerie Ayl- j\nmer,\" \" Morton House,\" etc,, entitled\nROSLYNS FORTUNE.\nWe have engaged a Full Corps of Distinguished i\nWriters, whose Contributions will enrich Godey's j\nLady's Book during the year.\nSend in your Clubs at once. You can add any :\nnames afterwards at the same price as the\noriginal Club.\nTERMS.—Cash in Advance.\nI'OBTAUK PREPAID.\nOne copy, one year, $2 (HI !\nTwo copies, one year 3 70 j\nThree copies, one year 5 25 '\nFour copies, one year, 0 60\nFive copies, one year, and an extra copy to the\nperson getting up the club, making six cop\nies 9 50!\nEight copies, one year, and an extra copy to j\nthe person getting up the club, making nine\ncopies, sl4 00 |\nr\nNow is the time to make tip your Club, j\nHOW TO It KM IT.- —Got a Post-office\"* Money |\nOrder on Philadelphia, or a Draft on Philadelphia |\nor New York. If you cannot get either of these, |\nsend Bank-notes, and in the latter case register\nyour letter.\nTo parties intending to get up Club, a specimen\n•opy will be sent on application.\nAddress,\nUODKY'BjLADY'S BOOK PUB. CO. (Limited),\n• 1006, Chestnut St., Philadelphia, Pa\nC3-THE REVIEW, is the\nj\nbest ADVERTISING MEDIUM. Do not i\nforget it.Jßcl\nI\nBUSINESS PARTY AND CALLING CARDS\nprinted to order.\n.\nCALL\nAND\nf\nI\n■\ni\nSEE\nOUR\nNEW VISITING AND BUSI\nNESS CARDS.\n!\nI |\nALVOIW) & SON.\nGreat\nCROWDS !\nat\nJ. L. KENT'S.\nand an\nj IMMENSE STOCK ! !\nDRESS GOODS,\nCLOAKS and SHAWLS,!\n|\nGLOVES and HOSIERY,\n! # !\n3 button Kid Gloves, only 75\nCents, worth a dollar.\n|\nI SHEETINGS & SHIRTINGS,\nof the best brands, cheap ! !\nCLOTHS and CASSIMERESj\nof all qualities and prices.\nI\nRIBBONS & FANCY GOODS,\n; the best selection ever offered\nin this market,\nj FLANNELS & BLANKETS,\nin endless variety.\nIn fact my assortment of DRY\nj GOODS is complete and is not\n' excelled by any establishment in\nthe country. In prices\nI DEFY COMPETITION !\nj and cordially invite inspection of!\nmy goods and a comparison of\nprices.\nCol. Means' mammoth\nI store, second door south of Mc.'\nIntyre Brothers hardware store.\n•T. IT. KENT,\nNov. 14. Agent. !\n1\nY ertical i\nFeed.\n'\ni\n'\nAs usual, the Vertical Feed\ni\ni\nSewing Machine took First Pre\n|\n•|\n!\nmium, at the late county Fair.\nT HI AL LIST, December term, 1870.\nTHIRD WEEK.\nS Klrby vh II C Carpenter ejectment\nArthur Cunningham vs 15 J Houoekneeht... .tresp |\nCornelia Turk's ad'm vs .1 Turk sci ta j\nAlexander Emits vs .1 N Cole appeal\nA V Snyder vs G S Ackley appeal i\nEdward Overton's adin vs John Conmey\nFrost's Sons vs Federal Ins Co asspt\nElizabeth Drake et al use vs S II Farnsworth.. .ejet\nBrad I. & It A of Athens vs F A Moot sei fa\n1) 15 Walker et al vs l'a it N Y lilt Co eject\nGuy C Hollon vs Elhanan Smith appeal j\nWin M Mallory vs James T Clark et al ...partition\nJ C Itlum vs Andrew .1 Layton trespass\nC A Ileavener vs David llervener's exr asspt\nJ 15 Bradley \\s Alonzo Hill et al ejectment\nM Cunningham vs David Whipple\nBrad 15 it E A of Athens vs X 15 Reeves scl fa\nDaniel Jagger* vs Lewis Biles et al trespass\nWin H Barnes vs Wm May trespass\nHiram Horton's use vs Erastus Sliepard sei fa\ndo do do do..\ndo do do do..\nH 15 Ingham vs James McCrossen\nCatherine D Left'ler vs Wm Left'ler et al issue\nI, F Goetehius vs Wm Gardner debt\nSubpienas for second week returnable Monday\nDecember Bat 2 p. in.; subpcenas for third week re\nturnable on Monday December lit at 2 p. in.\nGEORGE W BLACKMAN,\nTowanda Nov. 12 1879. I'rolhonotary.\ny\\ILY HE VIEW !\nOiil .y Twenty- ivc\nCents ii IVloiitli.\n.\nTRY IT?\nText Book I Uniformity.\nRESULT WHERE ROOKS HAVE TO\nSTAND ON THEIR OWN MERIT.\nAt it Convention of School Directors, of\nCentre County, held a Bellefonte, Decem\nber 20, 1878, pursuant to the call of 11.\nMeyer, Esq., County Superintendent, for\nthe purpose of considering the propriety\nof taking measures to secure a uniformity\nof the text-books used in the schools of\nsaid county, the following action was\ntaken, over fifty directors being present\nand nearly all the district in the county\nbeing represented:\nCOPY OF MINUTES.\nUpon motion of C. P. Stonerod, of Snow j\nShoe township, the following preamble and I\nresolutions were adopted:\nWHEREAS: Great expense and waste are'\nfrequently incurred by the present and eon\nnstatly changing variety of text,-books used in\nthe common schools of Centre county, there\nfore, be it\nJiesolvcd, By the representative directors\nhere in session, that a system of text-books, j\nsuitable, complete and uniform, he adopted in I\naccordance with the luws of the State, I\nthroughout the county.\nUpon motion of J. C. P. Jones, the follow\ning plan was adopted with hut one dissenting I\nvote, to carry into effect the following pre- j\namble andresolutions:\nFirnt. TNj, various publishing houses to j\nsend samples of their to eat* school'\nboard in tne county ror examination and to\nsubmit therewith the lowest exchange, intr -\nduetory and wholesale prices, and the length\nof time they will guarantee to furnish them\nat said price.\nSecond. No agent of any publishing house\nto be permitted to do any work in the county,\nto be either general or local agent, beyond\nsending his books and terms as above stated.\nAny house or agent violating this under\nstanding, their books to be counted ou of the\ncontest.\nThird. The several school boards of the\ncounty, after examination of the various\nbooks* which may have been submitted, to\nhold a meeting at which each director shall\nmake out a list of the books which he prefer*\nto have adopted in the county, and se d it to\nHenry Meyer, Esq., County* Superin n dent,\nltebersburg, Pa., prior to the first day of\nJune, 1879, who shall malic • _w e\nseveral statements so sent, and the books up\non the various branches having the ighest\nnumber of votes or preference shall be the\nseries recommended for county uniformity.\nThe County Superintendent, after having\nmade the above canvaos as above, to send the\nresult of the same to each of the papers in the\ncounty for publication.\nW. C. HEINLK, Chairman.\nJ. C. P. JONES, Secretary.\nThe following is the result of the votes\nof the Directors of Centre county, Pa., on\nthe uniformity of Text-books iu said\ncounty, with the number of votes cast fro\neach book, under the foregoing plau and\nresolutions:\nHEADERS. No. vote.\nfor caeeh\nNew Graded 74\nIndependent 20\nAppleton's 17\nNew American 12\nSPELLERS.\nSwinton's 83\nNew American 6\nIndependent 23\nAppleton's 1\nPatterson's\nSander's Union\nRaub's j\nGEOGRAPHIES.\nSwinton's 100\nColton's 14\nMitchell's 10\nIndependent 1\nMonteith's 6\nHISTORIES.\nSwinton's 08\nRcdpath's 5\nBarnes' Brief 7\nButler's\nOuackcnbos' 1\nWatson's .... o\nV KITTEN ARITHMETIC.\nRobinson's Shorter Course 57\nGreenleaf's IA\nBrook's -v\nGilne's 22\nBolF's 12\nNrook's Union g\nMew American 4\n>IENTAL ARITHMETIC.\nMilne's 7\nGreenleafs 4\nALGEBRA.\nRobinson's 53\nGreenleafs 1\nCOPY BOOKS.\nSpencerian tin\nAppleton's 30\nEllsworth's 10\nGRAMMARS.\nKerl's 72\nSwinton's IT\nClark's Brief 15\nBullion's j\nHarvey's 20\nOuackcnbos' j\nI Fewsmith's 1\nLANGUAGE LESSONS.\nKerl's 5\nI Clark's 5\nI Harvey's 1\nMorton's 5\nBOOK-KEEPING.\nBrvant A Stratum's 44\n| Folsom's g\n; Smith's\nCIVIL GOVERNMENT.\n| Townsend's... -\nBOTANY.\n| Grav's 49\n! Steele's\nGEOLOGY.\n! Dana's 33\nDRAWING.\nWhite's Industrial 4*\nPHYSIOLOGY.\nSteele's 2\nCutter's\nNATURAL PHILOSOPHY.\nSteele's g\nThe attention of Directors is called to\nSection LXII of the School Laws, which\nrequires every School Board in the State\n1 o adopt a series of Text-books every,\nj year, during vacation, which books, and\ni no others, can be used during the ensuing\nj school year. This is intended to fix a\nuniform course of study for the school 01\nj each district.\nThe undersigned having been appoint\ned a Committee to count the vote on\ncounty uniformity of Text-books in Cen\ntre county, respectfully report that\nj they have careftilly performed such duty\nj and that the foregoing is a correct can- .\n1 vass of the same.\nSAMUEL FRANCE,\nJARED HARPER\nW. C. HEINLE^\nCommittee appointed by the County\nSuperintendent to canvass the votes\nBELLKFONTE. PA., June 23, 1879.",
        "seq_num":"sn86081381",
        "state":"Pa",
        "date_field":"1879-12-19T00:00:00Z",
        "id":"c3f2c24d-4597-4c45-9545-1e67043e4393",
        "_version_":1505521397775990784},
      {
        "city":"Towanda",
        "loc":"-76.443069458,41.7647781372",
        "text":"VOLUME I, NO. 107.\nBusiness Cards.\nALVORD & SON,\nJOB PRINTERS,\nDAILY REVIEW OFFICE, Main street, Towanda\nBENTLY MEEKER,\nCLOCK & WATCH-MAKER AND\nREPAIRER. All at the lowest prices.\nMonroeton, Pa.\nDR. T. B. JOHNSON,\nPHYSICIAN AND SURD EON,\nOffice over 11. C Porter's Drug Store, Residence\ncorner Maple and Second Streets,\nJOHN VV. CODDING,\nA TTORNE Y-AT-LA W y\nOffice over Mason's old Bank.\n1863. 1879.\nTTIRB cf LIVE INSURANCE.\nWlll. S. Vincent,\nMain-st, Towanda, Pa.\nLargest, Safest, Oldest and best companies repre\nsented. 17sept79.\nHENR Y STR EE TELI,\nATTORNEY & COUNSELOR AT LAW\nTOWANDA, PA.\nGW. RYAN,\n• CO UNT Y S UPERIN TEN I) EN 7.\nOffice Patton's Block.\nOD. KINNEY,\nA T TOR NE Y-A T- L .l W.\nOffice, corner Main and Pine Streets, Towanda, l'a.\nT */iLIAMS & ANGLE,\nVV AT TORN E YS-A T- L A If,\nOffice formerly occupied by W. Watklns.\nA & SON,\nL- A 7 TORNE YS-A T- LA ir.\nSouth side Mercur Blook, Towanda, Pa.\nN. C. KLKBUEK. I L. ELHBREE.\nT^OR\nHiiiu < ?ut smd Slnive\nOo to the\nWARD HOUSE SHAVING PARLOR\nSTEI )(iE\nIs there.\nC° AI \"\nNATHAN TIDD,\nDI.ALKII IN\nPITTSTON, WILKES - BAR RE, AND\nLOYAL SOCK COAL.\ninvites the patronage of his old friends and the pub\nlic generally- I shall keep a full assortment\nof all sizes,\nANI) SHALL *ELL AT\nLOWEST PRICES FOR CASH.\nYard and office, foot of Pine street, just south ot\nCourt House.\nAug. 30 N. T1DI).\nPROPOSALS FOR POOR HOUSE\nFARM.\nCOMMISSIONERS' OFFICE,\nTowanda, Nov. <5*1879. \\\nThe Poor House system of maintaining the poor\nof Bradford eonnty having been adopted by a ma\njority of the votes of the electors of the county, the\nundersigned will reecho proposals at thei.i office in\nTowanda, for the next thirty days, for the sale of\nVtarniH suited to the purposes of a Boor House Farm.\nIn stating proposals give the quantity and quality\nto land, tin- improvements, how watered, where lo\ncated, and the price asked.\nThe information so communicated will be regard\ned by uo as confidential until we have determined\nupon a purchase.\nDANIEL BRADFORD,\n-I. VV. HURST,\nM. F. RANSOM,\nC ounty Commissioners.\nDAILY\nTOWANDA REVIEW.\nTOWANDA, PA., SATURDAY AFTERNOON, DECEMBER 13, 1879.\nThe News Condensed.\nGeneral Grant received an enthusiastic\n, reception in Cincinnati.\nFrancis E. Hayden has been acquitted\nof the alleged poisoning of his sister.\nGreat anxiety prevails in Russia in ex\npectation of new repressive measures by\nthe Goverment.\nThe Chamber of Deputies at Paris has\nappropriated $1,000,000 to relieve thesuti\ni ering poor of France.\nGovernor Hoyt has again refused to\ndeliver Mr. Kedhelier, whom Mrs. Walling\nibrd claims married her, to the New York\nauthorities.\nThe Surgeon General of the United\nState Marine Hospital has issued a circu\nlar for the guidance of persons desiring\nto enter the medical corps of that service.\nThe Republican papers of Kansas prove,\non a count, to be about equally divided\nbetween Grant and Blaine as presidential\ncandidates.\nEx-Secretary of War McCrary expects\nto leave Washington early next week to\nassume the duties of I uited States Judge\nof the Eighth Judicial Circuit.\nThe officers of the new French Cable\nCompany deny that there is any defect in\ni the cable, and declare that the line w ill\nbe obened for trullic shortly.\nThree thousand four hundred and lifty\none acres ol' white pine and white oak\ntimber land in Centre county lias been\nsold foi <562,000 to Mr. John T. Fowler\nof Fowler post-ottice that county.\nAmong the converts made to temper\nance by a \"blue ribon\" movement in At\nlanta, Ga., is Major S. \\V. Small (\"Old\nSi\"j> one of the funny writers of the At\nlantic Constitution.\nAbout two hundred colored refugees\nbound for Indiana passed through Wash\nington on Wednesday night. They expect\n! to sett le near Greeneastle, in that State.\nSeveral thousand additional \"hands\"\ncould be employd there.\nHaulan, the oarsman, was in New\nYork Thursday and signed a paper agree\ning to extend until December 22 the terms\nof the compact enter into November 1)5.\nllanlan says this is the last chance lie\nwill give Courtney to row lor the $6,000\nprize.\nWhen the Treasury Department was\ncutting down expenses in 1876 the salar\n| ics of all the subordinate oliieers and ein\n| ployees in the New \\ ork C'usloin-house\nwere reduced ten per cent. An etfort is\nnow being made to have these salaries\nrestored to the old figure.\nThe present purpose of the Democracy\nin Washington is to have a short session\nand adjourn by May 1. There is not\nlikely to be a revision of the tariff or other\ngeneral legislation. The majority are on\n1 their good behavior and have become rid- i\niculously demure.\nThe Postmaster General yesterday is\nsued an order to the postmasters in New\nYork forbidding the payment of any pos- |\ntal money order drawn to the order of j\nSimpson &, Co. at No. 4l> Exchange Place, !\nNew York, and to return all registered !\nletters addressed to this tirin to the post\nmasters at the oliices where they were 1\noriginally mailed. The order is based\nupon investigations of a special agent of\nthe Post Oltiee Department, who reports\nthat Simpson & Co. arc engaged in con\nducting a scheme or device for obtaining\nmoney through the mails by means of\nfalse and fraudulent pretenses.\n• ' I\nW el come\nNews !\nREDUCTION\nin prices of the\n| l<\nLOYAL\nSOCK !\nat\nI\nI\n!\nCoal Yard.\n—\"\"\n' YARD PRICES.\nLARGE STOVE, $3 OO |\nSMALL STOVE, . 3 25 j\nCHESTNUT, 7 2 s\ni\nEGG, 3 OO |\nGRATE, 3 OO J\nSMALL CHESTNUT, 2 IC I\nJ 1\nThe usual price tor cartage to be\nadded to above,\nALL UAL THOROUGH-\nLi'SCREENED\n(iCr* Full W eights\nteed : as\n11* . n.ii. r.t> it v.\nTowanda, Dec. 2, 187 c).\nPRICE ONE CENT\nGREAT\nCROUDS\nContinually attend the\nAuction Sale\nOF FINE\nDry Goods\nin the store formerly occupied by J.\nKENT, Moore's Block.\nI'lH' stock comprises large lines of\nlIRKSS GOO I)S, CALICOES, DOMESTICS,\nTABLE LINENS, TOWELSund TOWELNG,\nFLANNELS, MARSEILLES and CROTOIIET\nQUILTS, BLANKETL, HOSIERY OF ALL\nKINDS, KNIT UNDERWEAR, GLOVES\nin great variety, LADIES SKIRTS,\nand CORSETS, UMBRELLAS and\nI'ARASOLS, RIBBONS, and\nRUCHES, COLLARS, and\nCUFFS, LACES, and\nVEILINGS, and\nFANCY GOODS\nand NOTIONS, FINE TABLE and POCKET CUT*\nLERA . In fact everything found in a first\nelans store.\nNo old styles an in most Bankrupt stocks, the\n: goods having befcn purchased within the year.\nSales at 1 and 7 p. in., until stock is closed.\nLadies Especially invited. No reserve.\nD. LYONS.\n1831. THE CULTIVATOR 1880.\nAND\nC /Oiinti'y Gentleman.\nThe Best of the\nAG KI CULT URAL WEE KLI Ev>.\nIt is UNSURPASSED, if not UNEQUALKD, for the\nAmount and Variety of the PRACTICAL INFORMA\nTION it contains, and for the Ability and Extent of\nits CORRESPONDENCE—in the Throe Chief Directions\nof\nFarm Crops and Processes,\nHorticulture and Fruit-Fro wing,\nLive Stock and Dairying—\nwhile it also includes all minor depatments of rural\ninterest, such as the Poultry Yard, Entomology,\nBee-Keeping, Greenhouse and Grapery, Veterinary\nReplies, Farm Questions and Auswers, Fireside\nReading, Domestic Economy, and a summary o\nthe News of the Week. Its MARKET REPORTS are\nunusually complete, and more information can he\ngathered from its columns than from any other\nsource with regard to the Prospects of the Crops, as\nthrowing light upon one of the most important of all\nquestions— When to Buy and When to Sell. It is\nliberally illustrated, and constitutes to a greater\ndegree than any of its contemporaries A LIVE\nAGRICULTURAL NEWSPAPER\nOf never-failing interest both to Producers and Con\nsumers of every class.\nThe COUNTRY GENTLEMAN is published Weekly\non the following terms, when paid strictly in ad\nvance : One Cepy, one year, *2.50; Four Copies,\n*lo, and an additional copy for the yeuv free to\nthe. tender of the Chit- Ten Copies, *2O, and an\nadditional copy for th year free to the tender of\nthe Club.\nFor the year 1880, these prices include a copy of\nthe ANNUAL REOIHTEROF RURAL AFFAIRS, to each\nsubscriber—a book of 144 pages and about 120 ne\ngravings—a gift by the Publishers.\nAll NEW Subtcribers for 1880, paying in ad\nvance now, will receive the paper WEEKLY, from\nreceipt of remittance to January Ist, 1880, with\nout charge.\nSpecimen copies of the paper free. Address\nLUTHER TUCKER & SON, Publishers,\nAlbany, N. Y.",
        "seq_num":"sn86081381",
        "state":"Pa",
        "date_field":"1879-12-13T00:00:00Z",
        "id":"b6a93641-2d11-4062-906a-15e9b3d184e2",
        "_version_":1505521397922791424},
      {
        "city":"Towanda",
        "loc":"-76.443069458,41.7647781372",
        "text":"A REAL CHRISTMAS STORY.\nWRITTEN MORE THAN 1800 YEARS AGO.\nWhile Ilerod was king in Judea there\nwas a priest named Zacharias. His wife's\nname was Elizabeth. Both 6f them were\nold, and righteous, and careful to obey\nGod's commandments ; but God had nev\ner given them a child.\nThere were many priests among the\nJews, who served in the temple by cours\nes. There were twenty-four courses;\neach one had its name, and that which\nZacharias belonged to was callad the\ncourse of Abia.\nVery early every morning, before it was\nlight, the priests at the temple began the\nwork of the day. Some of them went to\nthe altar of burnt-offering and cleaned it,\ntaking away the ashes that had been left\nthere from the day before, and putting\nfresh wood on the tire which was never\nallowed to go out. Other priests went\ninto the temple and trimmed the lamps\non the golden candlestick, and cleaned\nthe golden altar of incense. Afterward\none of the priests offered up a lamb, and\nanother burned incense. Everyday be\nfore the priests began their work lots\nwere cast to determine what part of the\nservice each one was to take. On a cer\ntain day it fell to the lot of Zacharias to\nburn incense on the golden altar; and\nwhile he was in the temple he saw an\nangel standing beside the golden altar.\nWhen he saw him he was afraid, but the\nAngel said, Fear not, Zacharias, for God\nwill give to thee and to thy wife a son\nand thou shalt call his name John. He\nshall not drink wine nor any strong\ndrink, and shall be lilled with God's Holy\nSpirit from the time he is born. Zacha\nrias said to the angel, How shall I know\nthat these things will be? The angel an\nswered him. I am the angel Gabriel who\nlive in heaven, and stand before God to\ndo whatever he commands me, ami he\nhas sent me to tell this good news. And\nnow, because thou hast not believed it,\nthou shalt be punished by being dumb\nand unable to speak, until the words I\nhave spoken come true.\nAnd the people who were waiting in\n(he courts of the temple for Zacharias to\ncome out, wondered what kept him so\nlong. When he came they saw he could\nnot speak, but he made them understand\nby signs that he had seen a vision.\n* * * * *\nAnd God gave to Zacharias and Eliza\nbeth the son he had promised. When\nthe child was eight days old their neigh\nbors and relatives came together to dedi\ncate or give him to the Lord, and to de\ncide what name should be given him; and\nthey called him Zacharias after the name\nof his father. But his mother said he\nmust be called John. They suid thcTe be\nnone of your relations of this name; and\nthey made signs to his father, asking\nwhat he would have him called; and he\nasked for a writing table (for he was still\nspeechless), and wrote saying, his name\nis John. As soon as he had written these ,\nwords God gave him power to speak\nagain. And all the people in those parts j\nheard of those things and they said\nWhat manner of child shall this be ? And '\nthe boy grew, and the Lord blessed him, i\nand he went and lived in the wilderness j\nand became a great preacher.\nAt this time the Jews were servants to '\nthe Romans, and had to obey the Emper-1\nor; and he made a dei ree that all the\nJews should be taxed and commanded\neach one of them to go to the city where\nhis ancestors had lived so that his name\nmight be taken down. Among the num\nber who went up to the city of David to\nbe taxed, was a poor carpenter named Jo\nseph, and his wife who was a cousin of\nElizabeth. They journey od from Naza\nreth, and on reaching Bethlehem found\nthe inn tilled so that they were compelled\nto seek lodging in the stable; while there\nGod fulfilled a promise made to Mar}'\nabout the time of Zacharias' wonderful\nvision, and gave her a son.\nLowly as was his birth, it was hera 1\ni by angels who appeared to shepherds as\n! they watched their flocks in the adjoining\n; fields.\nThe Babe of Bethlehem was visited by\nthe wise and great of the nation, and\n! through jealousy the wickod emperor en\ni deavored to slay him, but his life was\nI preserved and he grew to manhood, and\nhis life has furnished a model for all ages*\nIn the lives and career of these two\nboys was fulfilled the prophecies of ages,\nand in the death upon the Cross ofMrry's\n' son, redemption was made for all man\nkind.\nWe have given this brief and imperfect\nsketch of the first Christmas, in the hope\nthat a perusal of it may aid our young\ni readers to a better understanding of the\nsubject, and awaken an interest in the\n1 study of the only perfect guide for young\nand old—the Bible.\nNO REVIEW TOMORROW.\n- -\n50th YEAR\nof\nGODEY'S LADY'S BOOK.\nThe oldest and Best Fashion Magazine\nin America.\nSUBSCRIPTION PRICE\nREDUCED TO 82.00 PER YEAR.\nSubscriptions will be received at this Office ia\nClubs with this Paper.\nThe DAILY REVIEW and Godey's Lady's\nBook for one Year at 84.50.\nI\nSee what Godey's Lady's Book will Contain\nIN 1880.\n! Nearly 1200 pases of first-class Literary matter.\nI 12 Steel Plate Beautiful Original Engravings.\n; 12 Large and Elegantly Colored Fashion Plates.\n! 24 Pages of Vocal and Instrumental Music.\nI '.(00 Engravings, on Art, Science, and Fashion.\n12 Large Diagram Patterns of Ladies' and Chil\ndren's Dresses.'\n12 Architectural Designs for Beautiful Homes.\n| 200 ur more Original Receipts for Family Use.\nAnd the usual Original Department matters.\n' The January No. of the New Year will he issued\nDecember rst. and will contain the open n g chap\nters of one of the Best Serial Stories ever printed in\n1 American Magazine, by\nCHRISTIAN HELD,\nthe author of \" A Gentle Belle,\" \" Valerie Ayl- \\\nmer,\" \" Morton House,\" etc,, entitled\nROSLYN'S FORTUNE.\nWe have cagaged a Full Corps of Distinguished\nWriters, whose Contributions will enrich Godey's\nLady's Book during the year.\nSend in your Clubs at once. You can add any i\nnames afterwards at the same price as the\noriginal Club.\nI\nTERMS.—Cash in Advance.\nPOSTAGE PREPAID.\nj One copy, one year, $2 00\n: Two copies, one year, 3 70\n. Three copies, one year, 5 25\nFour copies, one year, 6 60 j\n, Five copies, one year, and an extra copy to the\nperson getting up the club, making six cop\n! , h\"H 9 50 1\n1 Eight copies, one year, and an extra copy to\nthe person getting up the club, making nine\ncopies, 00 I\nNow is the time to make up your Club.\nHOW TO REMIT. —Get a Post-oiflcefMoney |\nOrder on Philadelphia, or a Draft on Philadelphia j\nor New York. If you cannot get either of these, j\nsend Bank-notes, and in the latter case register !\nyour letter.\nTo parties intending to get up Club, a specimen\ncopy will be sent on application.\nAddress,\nGODEY'S,LADY'B BOOK PUB. CO. (Limited),\n1006, Chestnut St., Philadelphia, Pa\nV ertical\nFeed.\n_ I\nAs usual, the Vertical Feed;\nSewing Machine took First Pre\nmium, at the late county Fair.\n* I\nQOAL! COAL !\n( FOK C.iSH !\nThe following prices will be charged for .#.V-\nTtMRMCMTM£ €'ot I* in the yard, in all the\nyards signatures hereto attached, until furthe\nnotice:\nSTOVE, $ 4 25\nCHESTNUT, 4 25\nGRATE, 4 25\nEGG, 4 25\nBi>~ Cartage, FIFTY C ENTS PER TON IN\nj addition to above, and an EXTRA CHARGE for\ncarrying in.\nW. M. MAIjLORY, Towauua.\nHENRY MERCUR,\nNATHAN TIDD,\nE. B. PIERCE,\nBARTLETT BROS., Wysox.\nAI.Vt.IL LO IS IVfffD. formerly Phin\n• ney's :\n1\nHnllivan Coal,\nLARGE STOVE, $3 00\nSMALL STOVE, 3 23\nCHESTNUT, 3 25\nEGG t 3 00\nGRATE, 3 00\nSMALL CHESTNUT, 2 5\nWith same additional charges for cArtage.\nW. M. MALLORY.\nOctober, 24, 187' J.\nGreat\nCROWDS!\nj at\nJ. L. KENT'S.\nand on\nIMMENSE STOCK !\nDRESS GOODS,\nCLOAKS and SHAWLS,\nGLOVES and HOSIERY,\n3 button Kid Gloves, only 75\nCents, worth a dollar.\n' SHEETINGS & SHIRTINGS,\nof the best brands, cheap !\nCLOTHS and CASSIMERES,\nof all qualities and prices.\nRIBBONS & FANCY GOODS, j\nthe best selection ever offered\nin this market.\nFLANNELS & BLANKETS,\nin endless variety.\nI In fact my assortment of DRY\nGOODS is complete and is not 1\n1 excelled by any establishment in\nj r\nthe country. In prices\n! I DEFY COMPETITION !\n, and cordially invite inspection of\nm y goods and a comparison of\nI prices.\nCol. Means' mammoth J\nstore, second door south of Mc.\nIntyre Brothers hardware store.\n.X. IKENT,\nNov. 14. Agent.\nREVIEW !\n\\ I\nOnly Twenty-Five\nCent s a IVlonl li.\nTRY IT?\nREVIEW, is the\ni:\n; best ADVERTISING MEDIUM. Do not\nferret it. JEI\n! '\nBUSINESS PARTY AND CALLING CARDS\nprinted to order.\nI CALL\nI\nAND\nSEE\nOUR\nNEW VISITING AND BUSI\nNESS CARDS.\nALVORD & Sow.",
        "seq_num":"sn86081381",
        "state":"Pa",
        "date_field":"1879-12-24T00:00:00Z",
        "id":"11961f92-e36f-440d-8ff5-fe440c8fb07e",
        "_version_":1505521397857779712},
      {
        "city":"Towanda",
        "loc":"-76.443069458,41.7647781372",
        "text":"I\nTlie I >aily Review.\nTowandaPa., Wednesday, Dec'r 24, 1879.\nEDJTQBS :\nS. W. ALVORD. NOBLE N. ALVORD. j\n\"Daily Review\" only 25 cent* per\nmonth. Try it.\nAn Example in l'olitics.\nThe following complimentary notice of\none of the ablest and purest men of the\nempire state, is from the Biughaniton Jit\npvhh'ran. and we transfer it to our col\numns with more than ordinary pleasure,\nbecause we know that what is said o\nMr. I'LATT is truthful anil more than mer\nited. The remarks are also applicable to !\nmany active politicians in this state, nota-1\nble among whom are (J. A. GKOW, and I\nSecretary QUAY :\nTlnf selection of the Hon. T. C. Plattof j\nOwego, as the representative of the Em\npire State on the National Republican\nCommittee and his selection by the\nChairman as a member of the Executive\nCommittee, must be very gratifying, not :\nonly to his many friends, but to all good j\nRepublicans in the Southern Tier. It is a j\nlifting reeogeition of the best and most\nactive element in the Reprblican party,\nand a worthy compliment to a worthy\nman.\nBut aside from this, the matter suggests\nsome comparisons which may be studied\nwith profit by would-be leaders in political\naffairs. In almost every town and city,\nthere are men who aspire to be political\nleaders and who resort to all manner of\ndeceptions and tricks to gain temporary\ncontrol. These melt seem to think that\nsuccess is valuable at any price, and some\nof them, doubtless, wonder why they al\nways remain local politicians—why they\ndo not reach a notable place in politics.\nTo these men, t he success and preferment\nof such a mun afford a profitable example.\nWhy is he influential in State and even\nNational affairs? Why is he a recogui/.ed\nleader in his party throughout the State?\nIs it because he has shown high quali\nties of statesmanship? Is it because he\nis eloquent and persuasive in speech? Is\nit not rather because he is as true, as pure,\nas high-minded in political as in business\naffairs—because men have found from long\nexperience that he is frank and manly\ntruthful in statement, and wholly free\nfrom the small and sharp tricks that will\nsome times iuake a man successful as a\nward politician, but an absolute failure in\nany higher and more honorable place?\nThese, as we interpret them, are the\nmain elements of Mr. Piatt's success; and\nthe same is true of almost, if not quite,\nevery other man who attains to high posi\ntion in political matters. What a pity it\nis, then that the small polilions, often\ntimes men of much force and ability, can\nnot see and learn wisdom from such an\nexample as the political lifeofsueh a man\nas Mr. Piatt supplies.\nThe lltica Herald (Rep,) has a very\nstrong article against General Grant as a\nPresidential candidate, saying that \"the\nsigns are unmistakable that General\nGrant can never receive another Presi\ndential nomination at the hands of a Re\npublican convention without first encoun\ntering an organized and determined oppo-;\nsition which would be fatal to his cordial j\nand united support by the masses of the |\nparty in 1880.\" Of Grant's supporters j\nand their aims it remarks :\n\"Two classes of people are still clam\norous for Grant. One class includes the\ntraders in politics who hope to see in his !\nreturn to the White House a return of\ntheir day of harvest, so rudely interrupt\ned. The other and larger class includes\nthe army of moral cowards, the timid i\nfolk who are still oppressed by the night\nmare of the civil war, and think that j\nGrant is needed at Washington to repel!\nsome new imaginary attack upon the cap\nital, which only he can conquer. It will\nbe a sad day for the United States when\na combination of these two classes can\nboast that it has dictated the government\nof the nation.\"\nNO REVIEW TO-MORROW.\nCHRISTMAS, 187b.\nNEW YEARS, 1880.\nEXTRAORDINARY INVOICE\nOK\nHOLIDAY\ni\nANI)\n>1 illiner\\y Groods.\nMrs. S. H. Sweet\nOffcrH at her Emporium of Fancy Goods\nMILLINERY AND YANKEE NOTIONS.\nA FRESH STOCK\nRecently purchased, at the\nLOWEST POSSIBLE PRICES.\nConstating of Huts, Fancy Goods, Toweling, Collars, j\nComforters, Embroideries, Flowers, Ribbons, j\nHandkerchiefs, silk, linen and embroidered, Feath\ners and Tips, Slipper Patterns, Card-board, Zephyrs,\nCombs, .Tot Ornaments. Hunching, Necklaces, Veil\ning in all colors, .lava Canvas Patterns, Lace Capes,\nCrape Pellisses, Babies' Knit Stockings, Ladies'\nllose in all colors and styles, Dolls, Children's\nSacks, Hoods and Mittens, Ladies' Nubias in all\ncolors, Bracelets, I'oeket Books, Mottoes. Birds and\nFeathers, Shawls, Jewelry, Ladies' and Gentle- |\nmen's\nUN DE RW EAR.\nIn short, EVERYTHING pertaining to a complete j\nassortment of seasonable\nFANCY GOODS\nand\nSTYLISH MILLINERY, j\nHATS TRIMMED, in all styles and colors, and\nof every variet yof material: Fur, Felt and Straw, at j\nMRS. SWEET'S\nFancy Goods Bazar,\nDec. 17 Main Street, Towanda.\nE. ROSEN FIELD'S\nj\nFall Opening\nCLOTHING\nIIATS, CAPS,\nNECKWEAR, GLOVES, HOSIERY,\nand u full Hue of\nGENTS' FURNISHING GOODS,\nwhich are offered\nEXCEEDINGLY LOW.\nCall and see ine, examine goods, learn prlees, &c '\nM. K. ROSENFIELD.\nTOE JOHNSON,\nFASHIONABLE BARBER,\nUnder Market, one door south of Ward\nHouse.\nCareful and experienced workmen always ready\nto wait upon customers.\nFIRM.\nH. Davidow St 15r*o.\nCASH PAID\nFOR\nFUR,\nHIDES,\nPELTS,\nWOOL,\nBEESWAX,\nNo. 4, Bcidleinan,s Block, Bridge St\nTowanda, October 28.\nJ FIGHT MIT SIGEL\nand ail\nHONORABLY DISCHARGED SOLDIERS\nwill consult their own interests ny calling at\nJACOBS'\nlong established and well known\nONE PRICK\nCLOTHING\nHOUSE,\nPATTON'S BLOCK,\nand buy their coats, pants, vests, overcoats, shirts,\noveralls, Gloves, Hose, Ilats and Caps, and every\nthing in the line of line and stylish\nGENTS' FURNISHING GOODS.\nDon't be deceived by persons falsely representing\nthemselves to be JACOBS, but come directly to my\nstore iu I'attou Block, Main street, near Bridge stf\nH. JACOBS.\nIZ EW\nJOB\nPRINTING\nOFFICE.\nWc respectfully invite public attention to\nour\nCOMPLETE JOB PRINTING HOUSE!\nCorner Main and Pine streets, over the\nMusic Store.\nCOMMERCIAL PRINTING AND PHAMPLKT\nWORK A SPECIALTY.\nLETTER,\nNOTE\nAND\nBILL HEADS,\nENVELOPES,\nTAGS\nNeatly executed on the shortest notice.\nBUSINESS, PARTY AND CALLING CARDS\nprinted to] order.\nALVORD & SON.",
        "seq_num":"sn86081381",
        "state":"Pa",
        "date_field":"1879-12-24T00:00:00Z",
        "id":"712f4cca-f02a-4d8d-bf9f-d860614a6c03",
        "_version_":1505521397897625600},
      {
        "city":"Towanda",
        "loc":"-76.443069458,41.7647781372",
        "text":"The Daily Review.\nTowanda, Pa., Friday, Dec'r 19, 1879\nEDITORS :\n8. W. ALVORI). NOBLE N. ALVORD.\n\" Daily Mterien\" only 95 cent% per\nmonth. Try it.\nNew York Evening Post: —The Presi\ndent could not easily say anything strong\ner for the wise and safe policy of getting\nrid of the legal-tender notes than he said\nin his message and in his letter of the 4th\nof December.\nIlis conversation with General Ilawley\nFridry night, of which a report is printed\nin the Herald Saturday, is of interest not\nbecause the President said anything new,\nbut because he reaffirmed what he had\nsaid already.\nlie believed that a discussion of the\ngreenback question will show that \"the\ntrue issue\" is now, as heretofore, \"be\ntween inflationists 011 one side and the\nfriends of sound, stable constitutional\ncurrency on the other.\nlie urges hard-money men to vote\nagainst proposals \"which arc against an\nearly return to a constitutional currency,\"\nand to vote for all proposals \"which, like\nMr. Bayard's, look to the action recom\nmended by the message.\"\nHe does not regard the matter \"as a\nmere party question,\" hut he warns the\nRepublicans that if they are not true to\nsound principles they may enable the\nDemocratic party \"if it is wise to carry\nthe country in 1880.\"\nThe President stands fast. Lot us\nstand by the President.\nThe New York Tribune of Sunday pub\nlishes an interesting list of the residents\nof that city who pay, avoid and ignore\nthe assessiuents on their personal proper\nty. The table shows that the commis\nsioners of taxes assessessed per\nsons. of this number the pittiful few of\n1,899 pay, \"and these,\" says the Tribune\n\"paying tax on sums greatly reduced\nfrom the original assessment, are among\nthe poorer classes of people in the city.\"\nThose who will pay no tax are 0,219, of\nthe wealthiest citizens, who march up to\nthe assessors' office and swear they have\nno personal property. The balance, 8,-\n505, merely default and lot their tax swell\nthe constantly growing deficiency list.\nThe aim of the Tribune in printing this\nlist is that \"a lull exposeure of the ab\nsurdity of the system of assessment, the\nridiculous conditions under the law, and\nthe lax manner in which arrears are col\nlected, compromised or abandoned as\nworthless, will lead to the reform of the\nlaws and tin? improvement of tin- entire\nsystem.\nIt is said that since the fraudulent\nwork in Maine has been announced, Re\npublican Congressmen from this State\nseem to be in favor of the Legislature\nchoosing the electors for New York. It is\nnot impossible that such a course may,\neventuullj', be justified; hut it seems a\nhasty conclusion at present. Nor is it\nprobable, although so reported from\nWashington, that the majority of the Re\npublican Congressional delegates from\nthis state, have so expressed themselves.\nThe conclusions of Washington corres\npondents must often lie taken cum grano\nBalis, especially in times of political ex\ncitement.—Binghamton Jiepbulican.\nThe average speed of express trains in\nthis country is not, probably, over thirty\nmiles an hour, hut there are a few trains\nwhich much exceed this rate. The New\nYork express on the Old Colony road\nmakes the run from Boston to Taunton,\n34 miles, in 47 minutes; the Boston and\nProvidence Shore line express makes a\nrnn of 44 miles in 00 minutes; both of\nthese are beaten by the Jersey City and\nPhiladelphia fast express, which makes\n89 miles in 111 minutes, an average of a\nmile in one and a quarter minutes.\nk\nCHRISTMAS, 1879.\nNEW YEARS, 1880.\nEXTRAORDINARY IN VOICE\nOK\nHOLIDAY\nANI)\niVlilliiieT\\y Cxoodw.\n-\nMrs. S. If. Si vest\nOflfcrH at her Emporium of Fancy Good*\nMILLINERY ANI) YANKEE NOTIONS, i\nA FRESII STOCK j\nRecently purchased, at the\nLOWEST POSSIBLE PRICES.\ni\nConsisting of Hats, Fancy Goods, Toweling, Collars,\nComforters, Embroideries, Flowers, Ribbons, !\nHandkerchiefs, silk, linen and embroidered, Feath- !\nors and Tips, Slipper Patterns, Card-board, Zephyrs, j\nCombs, Jet Ornaments. Rusching, Nvcklacvs, Veil- j\ning in all colors, Java Canvas Patterns, Lace Capes,\nCrape Pcllisses, Rabies' Knit Stockings, Ladies' j\nHose in all colors and styles, Dolls, Children's j\nSacks, Hoods and Mittens, Ladies' Nubias in all j\ncolors, Bracelets, Pocket Books, Mottoes, Birds and i\nFeathers, Shawls, Jewelry, Ladies' and Gentle- j\nmen's\nUNDERWEAR.\nIn short, EVERYTHING pertaining to a complete\nassortment of seasonable\nFANCY GOODS\nand\nSTYLISH MILLINERY. ,\n11 ATS TRIMMED, in all styles and colors, and |\nof every variety of material: Fur, Felt and Straw, at j\nMRS. SWEET'S\nFancy Goods Bazar,\nDec. 17 Main Street, Towunda. ■\nE. ROSEN FIELD'S\nFall Opening |\nI\nCLOTHING\n>\nHATS, CAPS.\nNECKWEAR, GLOVES. HOSIERY,\nand a full line of\nGENTS' FURNISHING GOODS,\nwhich are offered\nEXCEEDINGLY LOW.\nCall and see tnc, examine goods, learn prices, &c\nI\n.\nI\nM. E. ROSENFIELD.\nJOHNSON,\nFASHIONABLE BARBER,\ni\nUnder Market, one door south of Ward\nHouse.\nCareful and experienced workmen always ready\nto wait upon customers.\nTyJKW FIRM.\n11. Davidow & Bro. ,\nCASH PAID\nFOR\nI\nFUR,\nHIDES,\nPELTS,\nWOOL,\nBEESWAX,\n|\nNo. 4, Reiillemun,s lllock, Bridge St | '\nTowanda, October 28.\nJ FIGHT MIT SIGKL\naud all\nHONORABLY DISCIIARQKD SOLDIERS\nwill commit their own interests uy calling at\nJ A C O B S'\nlong established and well known\nONE PRICE\nCLOTHING\nHOUSE,\nPATTON'S BLOCK,\nand buy their coats, pants, vests, overcoats, shirts,\noveralls, Gloves, llosc, Huts and Caps, and every\nthing in the line of fine and stylish\nGENTS' FURNISHING GOODS.\nDon't be deceived by persons falsely representing\nthemselves to be JACOBS, but come directly to my\nstore in Button Block, Main street, near Bridge stf\nH. JACOBS. j\nN BW\nJOB\nPRINTING\nOFFICE.\nWe respectfully invite public attention to\nour\nCOMPLETE JOB PRINTING IIOU8K!\nCorner Main and Pine streets, orer the\nMusic Store.\nCOMMERCIAL PRINTING AND PHAMPLKT\nWORK A SPECIALTY.\nLETTER,\nNOTE\nAND\nBILL HEADS,\nENVELOPES,\nTAGS\nNeatly executed on the shortest notice.\nBUSINESS, PARTY AND CALLINO CARDS\nprinted to order. •\n[\nALVOttD A SON.",
        "seq_num":"sn86081381",
        "state":"Pa",
        "date_field":"1879-12-19T00:00:00Z",
        "id":"43a46bb0-272d-44f8-9142-59724d1fb682",
        "_version_":1505521397818982400}]
  }}
